apache/mynewt-core/hw/mcu/ambiq/apollo2/include/mcu/apollo2.h
    struct {
      __IOM uint32_t ENABLE     : 1;            /*!< (@ 0x00000000) Enables the flash cache controller. I/D caching
                                                                    enabled independently.                                     */
      __IOM uint32_t LRU        : 1;            /*!< (@ 0x00000001) Sets the cache replacement policy. 0=LRR (least
                                                                    recently replaced), 1=LRU (least recently
                                                                    used). LRR minimizes writes to the TAG
                                                                    SRAM.                                                      */
      __IOM uint32_t ENABLE_NC0 : 1;            /*!< (@ 0x00000002) Enable Non-cacheable region 0                              */
      __IOM uint32_t ENABLE_NC1 : 1;            /*!< (@ 0x00000003) Enable Non-cacheable region 1                              */
      __IOM uint32_t CONFIG     : 3;            /*!< (@ 0x00000004) Sets the cache configuration                               */
      __IOM uint32_t SERIAL     : 1;            /*!< (@ 0x00000007) Bitfield should always be programmed to 0.                 */
      __IOM uint32_t ICACHE_ENABLE : 1;         /*!< (@ 0x00000008) Enable Flash Instruction Caching                           */
      __IOM uint32_t DCACHE_ENABLE : 1;         /*!< (@ 0x00000009) Enable Flash Instruction Caching                           */
      __IOM uint32_t CACHE_CLKGATE : 1;         /*!< (@ 0x0000000A) Enable clock gating of cache RAMs                          */
      __IOM uint32_t CACHE_LS   : 1;            /*!< (@ 0x0000000B) Enable LS (light sleep) of cache RAMs. When this
                                                                    bit is set, the cache's RAMS will be put
                                                                    into light sleep mode while inactive. NOTE:
                                                                    if the cache is actively used, this may
                                                                    have an adverse affect on power since entering/exiting
                                                                    LS mode may consume more power than would
                                                                    be saved.                                                  */
      __IOM uint32_t DLY        : 4;            /*!< (@ 0x0000000C) Data RAM delay                                             */
      __IOM uint32_t SMDLY      : 4;            /*!< (@ 0x00000010) Data RAM delay                                             */
      __IOM uint32_t DATA_CLKGATE : 1;          /*!< (@ 0x00000014) Enable clock gating of entire data array                   */
      __IM  uint32_t            : 3;
      __IOM uint32_t ENABLE_MONITOR : 1;        /*!< (@ 0x00000018) Enable Cache Monitoring Stats                              */
    } CACHECFG_b;
  } ;
  
  union {
    __IOM uint32_t FLASHCFG;                    /*!< (@ 0x00000004) Flash Control Register                                     */
    
    struct {
      __IOM uint32_t RD_WAIT    : 3;            /*!< (@ 0x00000000) Sets read waitstates (HCLK cycles)                         */
    } FLASHCFG_b;
  } ;
  
  union {
    __IOM uint32_t CACHECTRL;                   /*!< (@ 0x00000008) Cache Control                                              */
    
    struct {
      __IOM uint32_t INVALIDATE : 1;            /*!< (@ 0x00000000) Writing a 1 to this bitfield invalidates the
                                                                    flash cache contents.                                      */
      __IOM uint32_t RESET_STAT : 1;            /*!< (@ 0x00000001) Writing a 1 to this bitfield will reset the cache
                                                                    monitor statistics (DMON0-3, IMON0-3).
                                                                    Statistic gathering can be paused/stopped
                                                                    by disabling the MONITOR_ENABLE bit in
                                                                    CACHECFG, which will maintain the count
                                                                    values until the stats are reset by writing
                                                                    this bitfield.                                             */
      __IOM uint32_t CACHE_READY : 1;           /*!< (@ 0x00000002) Cache Ready Status (enabled and not processing
                                                                    an invalidate operation)                                   */
      __IM  uint32_t            : 1;
      __IOM uint32_t FLASH0_SLM_STATUS : 1;     /*!< (@ 0x00000004) Flash Sleep Mode Status                                    */
      __IOM uint32_t FLASH0_SLM_DISABLE : 1;    /*!< (@ 0x00000005) Disable Flash Sleep Mode                                   */
      __IOM uint32_t FLASH0_SLM_ENABLE : 1;     /*!< (@ 0x00000006) Enable Flash Sleep Mode                                    */
      __IM  uint32_t            : 1;
      __IOM uint32_t FLASH1_SLM_STATUS : 1;     /*!< (@ 0x00000008) Flash Sleep Mode Status                                    */
      __IOM uint32_t FLASH1_SLM_DISABLE : 1;    /*!< (@ 0x00000009) Disable Flash Sleep Mode                                   */
      __IOM uint32_t FLASH1_SLM_ENABLE : 1;     /*!< (@ 0x0000000A) Enable Flash Sleep Mode                                    */
    } CACHECTRL_b;
  } ;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t NCR0START;                   /*!< (@ 0x00000010) Flash Cache Noncachable Region 0 Start Address.            */
    
    struct {
      __IM  uint32_t            : 4;
      __IOM uint32_t ADDR       : 16;           /*!< (@ 0x00000004) Start address for non-cacheable region 0. The
                                                                    physical address of the start of this region
                                                                    should be programmed to this register and
                                                                    must be aligned to a 16-byte boundary (thus
                                                                    the lower 4 address bits are unused).                      */
    } NCR0START_b;
  } ;
  
  union {
    __IOM uint32_t NCR0END;                     /*!< (@ 0x00000014) Flash Cache Noncachable Region 0 End                       */
    
