apache/mynewt-core/hw/mcu/ambiq/apollo2/include/mcu/apollo2.h
    struct {
      __IM  uint32_t            : 4;
      __IOM uint32_t ADDR       : 16;           /*!< (@ 0x00000004) End address for non-cacheable region 0. The physical
                                                                    address of the end of this region should
                                                                    be programmed to this register and must
                                                                    be aligned to a 16-byte boundary (thus
                                                                    the lower 4 address bits are unused).                      */
    } NCR0END_b;
  } ;
  
  union {
    __IOM uint32_t NCR1START;                   /*!< (@ 0x00000018) Flash Cache Noncachable Region 1 Start                     */
    
    struct {
      __IM  uint32_t            : 4;
      __IOM uint32_t ADDR       : 16;           /*!< (@ 0x00000004) Start address for non-cacheable region 1. The
                                                                    physical address of the start of this region
                                                                    should be programmed to this register and
                                                                    must be aligned to a 16-byte boundary (thus
                                                                    the lower 4 address bits are unused).                      */
    } NCR1START_b;
  } ;
  
  union {
    __IOM uint32_t NCR1END;                     /*!< (@ 0x0000001C) Flash Cache Noncachable Region 1 End                       */
    
    struct {
      __IM  uint32_t            : 4;
      __IOM uint32_t ADDR       : 16;           /*!< (@ 0x00000004) End address for non-cacheable region 1. The physical
                                                                    address of the end of this region should
                                                                    be programmed to this register and must
                                                                    be aligned to a 16-byte boundary (thus
                                                                    the lower 4 address bits are unused).                      */
    } NCR1END_b;
  } ;
  __IM  uint32_t  RESERVED1[4];
  
  union {
    __IOM uint32_t CACHEMODE;                   /*!< (@ 0x00000030) Flash Cache Mode Register. Used to trim performance/power. */
    
    struct {
      __IOM uint32_t THROTTLE1  : 1;            /*!< (@ 0x00000000) Disallow cache data RAM writes on tag RAM fill
                                                                    cycles                                                     */
      __IOM uint32_t THROTTLE2  : 1;            /*!< (@ 0x00000001) Disallow cache data RAM writes on tag RAM read
                                                                    cycles                                                     */
      __IOM uint32_t THROTTLE3  : 1;            /*!< (@ 0x00000002) Disallow cache data RAM writes on data RAM read
                                                                    cycles                                                     */
      __IOM uint32_t THROTTLE4  : 1;            /*!< (@ 0x00000003) Disallow Data RAM reads (from line hits) on tag
                                                                    RAM fill cycles                                            */
      __IOM uint32_t THROTTLE5  : 1;            /*!< (@ 0x00000004) Disallow Data RAM reads (from line hits) during
                                                                    lookup read ops                                            */
      __IOM uint32_t THROTTLE6  : 1;            /*!< (@ 0x00000005) Disallow Simultaneous Data RAM reads (from 2
                                                                    line hits on each bus)                                     */
    } CACHEMODE_b;
  } ;
  __IM  uint32_t  RESERVED2[3];
  
  union {
    __IOM uint32_t DMON0;                       /*!< (@ 0x00000040) Data Cache Total Accesses                                  */
    
    struct {
      __IOM uint32_t DACCESS_COUNT : 32;        /*!< (@ 0x00000000) Total accesses to data cache                               */
    } DMON0_b;
  } ;
  
  union {
    __IOM uint32_t DMON1;                       /*!< (@ 0x00000044) Data Cache Tag Lookups                                     */
    
    struct {
      __IOM uint32_t DLOOKUP_COUNT : 32;        /*!< (@ 0x00000000) Total tag lookups from data cache                          */
    } DMON1_b;
  } ;
  
  union {
    __IOM uint32_t DMON2;                       /*!< (@ 0x00000048) Data Cache Hits                                            */
    
    struct {
      __IOM uint32_t DHIT_COUNT : 32;           /*!< (@ 0x00000000) Cache hits from lookup operations                          */
    } DMON2_b;
  } ;
  
  union {
    __IOM uint32_t DMON3;                       /*!< (@ 0x0000004C) Data Cache Line Hits                                       */
    
    struct {
      __IOM uint32_t DLINE_COUNT : 32;          /*!< (@ 0x00000000) Cache hits from line cache                                 */
    } DMON3_b;
  } ;
  
  union {
    __IOM uint32_t IMON0;                       /*!< (@ 0x00000050) Instruction Cache Total Accesses                           */
    
    struct {
      __IOM uint32_t IACCESS_COUNT : 32;        /*!< (@ 0x00000000) Total accesses to Instruction cache                        */
    } IMON0_b;
  } ;
  
  union {
    __IOM uint32_t IMON1;                       /*!< (@ 0x00000054) Instruction Cache Tag Lookups                              */
    
    struct {
      __IOM uint32_t ILOOKUP_COUNT : 32;        /*!< (@ 0x00000000) Total tag lookups from Instruction cache                   */
    } IMON1_b;
  } ;
  
  union {
    __IOM uint32_t IMON2;                       /*!< (@ 0x00000058) Instruction Cache Hits                                     */
    
