apache/mynewt-core/hw/mcu/ambiq/apollo2/include/mcu/apollo2.h
    struct {
      __IOM uint32_t CTTMRA3    : 16;           /*!< (@ 0x00000000) Counter/Timer A3.                                          */
      __IOM uint32_t CTTMRB3    : 16;           /*!< (@ 0x00000010) Counter/Timer B3.                                          */
    } TMR3_b;
  } ;
  
  union {
    __IOM uint32_t CMPRA3;                      /*!< (@ 0x00000034) Counter/Timer A3 Compare Registers                         */
    
    struct {
      __IOM uint32_t CMPR0A3    : 16;           /*!< (@ 0x00000000) Counter/Timer A3 Compare Register 0.                       */
      __IOM uint32_t CMPR1A3    : 16;           /*!< (@ 0x00000010) Counter/Timer A3 Compare Register 1.                       */
    } CMPRA3_b;
  } ;
  
  union {
    __IOM uint32_t CMPRB3;                      /*!< (@ 0x00000038) Counter/Timer B3 Compare Registers                         */
    
    struct {
      __IOM uint32_t CMPR0B3    : 16;           /*!< (@ 0x00000000) Counter/Timer B3 Compare Register 0.                       */
      __IOM uint32_t CMPR1B3    : 16;           /*!< (@ 0x00000010) Counter/Timer B3 Compare Register 1.                       */
    } CMPRB3_b;
  } ;
  
  union {
    __IOM uint32_t CTRL3;                       /*!< (@ 0x0000003C) Counter/Timer Control                                      */
    
    struct {
      __IOM uint32_t TMRA3EN    : 1;            /*!< (@ 0x00000000) Counter/Timer A3 Enable bit.                               */
      __IOM uint32_t TMRA3CLK   : 5;            /*!< (@ 0x00000001) Counter/Timer A3 Clock Select.                             */
      __IOM uint32_t TMRA3FN    : 3;            /*!< (@ 0x00000006) Counter/Timer A3 Function Select.                          */
      __IOM uint32_t TMRA3IE0   : 1;            /*!< (@ 0x00000009) Counter/Timer A3 Interrupt Enable bit based on
                                                                    COMPR0.                                                    */
      __IOM uint32_t TMRA3IE1   : 1;            /*!< (@ 0x0000000A) Counter/Timer A3 Interrupt Enable bit based on
                                                                    COMPR1.                                                    */
      __IOM uint32_t TMRA3CLR   : 1;            /*!< (@ 0x0000000B) Counter/Timer A3 Clear bit.                                */
      __IOM uint32_t TMRA3POL   : 1;            /*!< (@ 0x0000000C) Counter/Timer A3 output polarity.                          */
      __IOM uint32_t TMRA3PE    : 1;            /*!< (@ 0x0000000D) Counter/Timer A3 Output Enable bit.                        */
      __IM  uint32_t            : 1;
      __IOM uint32_t ADCEN      : 1;            /*!< (@ 0x0000000F) Special Timer A3 enable for ADC function.                  */
      __IOM uint32_t TMRB3EN    : 1;            /*!< (@ 0x00000010) Counter/Timer B3 Enable bit.                               */
      __IOM uint32_t TMRB3CLK   : 5;            /*!< (@ 0x00000011) Counter/Timer B3 Clock Select.                             */
      __IOM uint32_t TMRB3FN    : 3;            /*!< (@ 0x00000016) Counter/Timer B3 Function Select.                          */
      __IOM uint32_t TMRB3IE0   : 1;            /*!< (@ 0x00000019) Counter/Timer B3 Interrupt Enable bit for COMPR0.          */
      __IOM uint32_t TMRB3IE1   : 1;            /*!< (@ 0x0000001A) Counter/Timer B3 Interrupt Enable bit for COMPR1.          */
      __IOM uint32_t TMRB3CLR   : 1;            /*!< (@ 0x0000001B) Counter/Timer B3 Clear bit.                                */
      __IOM uint32_t TMRB3POL   : 1;            /*!< (@ 0x0000001C) Counter/Timer B3 output polarity.                          */
      __IOM uint32_t TMRB3PE    : 1;            /*!< (@ 0x0000001D) Counter/Timer B3 Output Enable bit.                        */
      __IM  uint32_t            : 1;
      __IOM uint32_t CTLINK3    : 1;            /*!< (@ 0x0000001F) Counter/Timer A3/B3 Link bit.                              */
    } CTRL3_b;
  } ;
  __IM  uint32_t  RESERVED[48];
  
  union {
    __IOM uint32_t STCFG;                       /*!< (@ 0x00000100) Configuration Register                                     */
    
    struct {
      __IOM uint32_t CLKSEL     : 4;            /*!< (@ 0x00000000) Selects an appropriate clock source and divider
                                                                    to use for the System Timer clock.                         */
      __IM  uint32_t            : 4;
      __IOM uint32_t COMPARE_A_EN : 1;          /*!< (@ 0x00000008) Selects whether compare is enabled for the corresponding
                                                                    SCMPR register. If compare is enabled,
                                                                    the interrupt status is set once the comparision
                                                                    is met.                                                    */
      __IOM uint32_t COMPARE_B_EN : 1;          /*!< (@ 0x00000009) Selects whether compare is enabled for the corresponding
                                                                    SCMPR register. If compare is enabled,
                                                                    the interrupt status is set once the comparision
                                                                    is met.                                                    */
      __IOM uint32_t COMPARE_C_EN : 1;          /*!< (@ 0x0000000A) Selects whether compare is enabled for the corresponding
                                                                    SCMPR register. If compare is enabled,
                                                                    the interrupt status is set once the comparision
                                                                    is met.                                                    */
      __IOM uint32_t COMPARE_D_EN : 1;          /*!< (@ 0x0000000B) Selects whether compare is enabled for the corresponding
                                                                    SCMPR register. If compare is enabled,
                                                                    the interrupt status is set once the comparision
                                                                    is met.                                                    */
      __IOM uint32_t COMPARE_E_EN : 1;          /*!< (@ 0x0000000C) Selects whether compare is enabled for the corresponding
                                                                    SCMPR register. If compare is enabled,
                                                                    the interrupt status is set once the comparision
                                                                    is met.                                                    */
      __IOM uint32_t COMPARE_F_EN : 1;          /*!< (@ 0x0000000D) Selects whether compare is enabled for the corresponding
                                                                    SCMPR register. If compare is enabled,
                                                                    the interrupt status is set once the comparision
                                                                    is met.                                                    */
      __IOM uint32_t COMPARE_G_EN : 1;          /*!< (@ 0x0000000E) Selects whether compare is enabled for the corresponding
                                                                    SCMPR register. If compare is enabled,
                                                                    the interrupt status is set once the comparision
                                                                    is met.                                                    */
      __IOM uint32_t COMPARE_H_EN : 1;          /*!< (@ 0x0000000F) Selects whether compare is enabled for the corresponding
                                                                    SCMPR register. If compare is enabled,
                                                                    the interrupt status is set once the comparision
                                                                    is met.                                                    */
      __IM  uint32_t            : 14;
      __IOM uint32_t CLEAR      : 1;            /*!< (@ 0x0000001E) Set this bit to one to clear the System Timer
                                                                    register. If this bit is set to '1', the
                                                                    system timer register will stay cleared.
                                                                    It needs to be set to '0' for the system
                                                                    timer to start running.                                    */
      __IOM uint32_t FREEZE     : 1;            /*!< (@ 0x0000001F) Set this bit to one to freeze the clock input
                                                                    to the COUNTER register. Once frozen, the
                                                                    value can be safely written from the MCU.
                                                                    Unfreeze to resume.                                        */
    } STCFG_b;
  } ;
  
  union {
    __IOM uint32_t STTMR;                       /*!< (@ 0x00000104) System Timer Count Register (Real Time Counter)            */
    
