apache/mynewt-core/hw/mcu/ambiq/apollo2/include/mcu/apollo2.h
    struct {
      __IOM uint32_t VALUE      : 32;           /*!< (@ 0x00000000) Value of the 32-bit counter as it ticks over.              */
    } STTMR_b;
  } ;
  
  union {
    __IOM uint32_t CAPTURE_CONTROL;             /*!< (@ 0x00000108) Capture Control Register                                   */
    
    struct {
      __IOM uint32_t CAPTURE_A  : 1;            /*!< (@ 0x00000000) Selects whether capture is enabled for the specified
                                                                    capture register.                                          */
      __IOM uint32_t CAPTURE_B  : 1;            /*!< (@ 0x00000001) Selects whether capture is enabled for the specified
                                                                    capture register.                                          */
      __IOM uint32_t CAPTURE_C  : 1;            /*!< (@ 0x00000002) Selects whether capture is enabled for the specified
                                                                    capture register.                                          */
      __IOM uint32_t CAPTURE_D  : 1;            /*!< (@ 0x00000003) Selects whether capture is enabled for the specified
                                                                    capture register.                                          */
    } CAPTURE_CONTROL_b;
  } ;
  __IM  uint32_t  RESERVED1;
  
  union {
    __IOM uint32_t SCMPR0;                      /*!< (@ 0x00000110) Compare Register A                                         */
    
    struct {
      __IOM uint32_t VALUE      : 32;           /*!< (@ 0x00000000) Compare this value to the value in the COUNTER
                                                                    register according to the match criterion,
                                                                    as selected in the COMPARE_A_EN bit in
                                                                    the REG_CTIMER_STCGF register.                             */
    } SCMPR0_b;
  } ;
  
  union {
    __IOM uint32_t SCMPR1;                      /*!< (@ 0x00000114) Compare Register B                                         */
    
    struct {
      __IOM uint32_t VALUE      : 32;           /*!< (@ 0x00000000) Compare this value to the value in the COUNTER
                                                                    register according to the match criterion,
                                                                    as selected in the COMPARE_B_EN bit in
                                                                    the REG_CTIMER_STCGF register.                             */
    } SCMPR1_b;
  } ;
  
  union {
    __IOM uint32_t SCMPR2;                      /*!< (@ 0x00000118) Compare Register C                                         */
    
    struct {
      __IOM uint32_t VALUE      : 32;           /*!< (@ 0x00000000) Compare this value to the value in the COUNTER
                                                                    register according to the match criterion,
                                                                    as selected in the COMPARE_C_EN bit in
                                                                    the REG_CTIMER_STCGF register.                             */
    } SCMPR2_b;
  } ;
  
  union {
    __IOM uint32_t SCMPR3;                      /*!< (@ 0x0000011C) Compare Register D                                         */
    
    struct {
      __IOM uint32_t VALUE      : 32;           /*!< (@ 0x00000000) Compare this value to the value in the COUNTER
                                                                    register according to the match criterion,
                                                                    as selected in the COMPARE_D_EN bit in
                                                                    the REG_CTIMER_STCGF register.                             */
    } SCMPR3_b;
  } ;
  
  union {
    __IOM uint32_t SCMPR4;                      /*!< (@ 0x00000120) Compare Register E                                         */
    
    struct {
      __IOM uint32_t VALUE      : 32;           /*!< (@ 0x00000000) Compare this value to the value in the COUNTER
                                                                    register according to the match criterion,
                                                                    as selected in the COMPARE_E_EN bit in
                                                                    the REG_CTIMER_STCGF register.                             */
    } SCMPR4_b;
  } ;
  
  union {
    __IOM uint32_t SCMPR5;                      /*!< (@ 0x00000124) Compare Register F                                         */
    
    struct {
      __IOM uint32_t VALUE      : 32;           /*!< (@ 0x00000000) Compare this value to the value in the COUNTER
                                                                    register according to the match criterion,
                                                                    as selected in the COMPARE_F_EN bit in
                                                                    the REG_CTIMER_STCGF register.                             */
    } SCMPR5_b;
  } ;
  
  union {
    __IOM uint32_t SCMPR6;                      /*!< (@ 0x00000128) Compare Register G                                         */
    
    struct {
      __IOM uint32_t VALUE      : 32;           /*!< (@ 0x00000000) Compare this value to the value in the COUNTER
                                                                    register according to the match criterion,
                                                                    as selected in the COMPARE_G_EN bit in
                                                                    the REG_CTIMER_STCGF register.                             */
    } SCMPR6_b;
  } ;
  
  union {
    __IOM uint32_t SCMPR7;                      /*!< (@ 0x0000012C) Compare Register H                                         */
    
