apache/mynewt-core/hw/mcu/ambiq/apollo2/include/mcu/apollo2.h
    struct {
      __IOM uint32_t CTMRA0C0INT : 1;           /*!< (@ 0x00000000) Counter/Timer A0 interrupt based on COMPR0.                */
      __IOM uint32_t CTMRB0C0INT : 1;           /*!< (@ 0x00000001) Counter/Timer B0 interrupt based on COMPR0.                */
      __IOM uint32_t CTMRA1C0INT : 1;           /*!< (@ 0x00000002) Counter/Timer A1 interrupt based on COMPR0.                */
      __IOM uint32_t CTMRB1C0INT : 1;           /*!< (@ 0x00000003) Counter/Timer B1 interrupt based on COMPR0.                */
      __IOM uint32_t CTMRA2C0INT : 1;           /*!< (@ 0x00000004) Counter/Timer A2 interrupt based on COMPR0.                */
      __IOM uint32_t CTMRB2C0INT : 1;           /*!< (@ 0x00000005) Counter/Timer B2 interrupt based on COMPR0.                */
      __IOM uint32_t CTMRA3C0INT : 1;           /*!< (@ 0x00000006) Counter/Timer A3 interrupt based on COMPR0.                */
      __IOM uint32_t CTMRB3C0INT : 1;           /*!< (@ 0x00000007) Counter/Timer B3 interrupt based on COMPR0.                */
      __IOM uint32_t CTMRA0C1INT : 1;           /*!< (@ 0x00000008) Counter/Timer A0 interrupt based on COMPR1.                */
      __IOM uint32_t CTMRB0C1INT : 1;           /*!< (@ 0x00000009) Counter/Timer B0 interrupt based on COMPR1.                */
      __IOM uint32_t CTMRA1C1INT : 1;           /*!< (@ 0x0000000A) Counter/Timer A1 interrupt based on COMPR1.                */
      __IOM uint32_t CTMRB1C1INT : 1;           /*!< (@ 0x0000000B) Counter/Timer B1 interrupt based on COMPR1.                */
      __IOM uint32_t CTMRA2C1INT : 1;           /*!< (@ 0x0000000C) Counter/Timer A2 interrupt based on COMPR1.                */
      __IOM uint32_t CTMRB2C1INT : 1;           /*!< (@ 0x0000000D) Counter/Timer B2 interrupt based on COMPR1.                */
      __IOM uint32_t CTMRA3C1INT : 1;           /*!< (@ 0x0000000E) Counter/Timer A3 interrupt based on COMPR1.                */
      __IOM uint32_t CTMRB3C1INT : 1;           /*!< (@ 0x0000000F) Counter/Timer B3 interrupt based on COMPR1.                */
    } INTSTAT_b;
  } ;
  
  union {
    __IOM uint32_t INTCLR;                      /*!< (@ 0x00000208) Counter/Timer Interrupts: Clear                            */
    
    struct {
      __IOM uint32_t CTMRA0C0INT : 1;           /*!< (@ 0x00000000) Counter/Timer A0 interrupt based on COMPR0.                */
      __IOM uint32_t CTMRB0C0INT : 1;           /*!< (@ 0x00000001) Counter/Timer B0 interrupt based on COMPR0.                */
      __IOM uint32_t CTMRA1C0INT : 1;           /*!< (@ 0x00000002) Counter/Timer A1 interrupt based on COMPR0.                */
      __IOM uint32_t CTMRB1C0INT : 1;           /*!< (@ 0x00000003) Counter/Timer B1 interrupt based on COMPR0.                */
      __IOM uint32_t CTMRA2C0INT : 1;           /*!< (@ 0x00000004) Counter/Timer A2 interrupt based on COMPR0.                */
      __IOM uint32_t CTMRB2C0INT : 1;           /*!< (@ 0x00000005) Counter/Timer B2 interrupt based on COMPR0.                */
      __IOM uint32_t CTMRA3C0INT : 1;           /*!< (@ 0x00000006) Counter/Timer A3 interrupt based on COMPR0.                */
      __IOM uint32_t CTMRB3C0INT : 1;           /*!< (@ 0x00000007) Counter/Timer B3 interrupt based on COMPR0.                */
      __IOM uint32_t CTMRA0C1INT : 1;           /*!< (@ 0x00000008) Counter/Timer A0 interrupt based on COMPR1.                */
      __IOM uint32_t CTMRB0C1INT : 1;           /*!< (@ 0x00000009) Counter/Timer B0 interrupt based on COMPR1.                */
      __IOM uint32_t CTMRA1C1INT : 1;           /*!< (@ 0x0000000A) Counter/Timer A1 interrupt based on COMPR1.                */
      __IOM uint32_t CTMRB1C1INT : 1;           /*!< (@ 0x0000000B) Counter/Timer B1 interrupt based on COMPR1.                */
      __IOM uint32_t CTMRA2C1INT : 1;           /*!< (@ 0x0000000C) Counter/Timer A2 interrupt based on COMPR1.                */
      __IOM uint32_t CTMRB2C1INT : 1;           /*!< (@ 0x0000000D) Counter/Timer B2 interrupt based on COMPR1.                */
      __IOM uint32_t CTMRA3C1INT : 1;           /*!< (@ 0x0000000E) Counter/Timer A3 interrupt based on COMPR1.                */
      __IOM uint32_t CTMRB3C1INT : 1;           /*!< (@ 0x0000000F) Counter/Timer B3 interrupt based on COMPR1.                */
    } INTCLR_b;
  } ;
  
  union {
    __IOM uint32_t INTSET;                      /*!< (@ 0x0000020C) Counter/Timer Interrupts: Set                              */
    
    struct {
      __IOM uint32_t CTMRA0C0INT : 1;           /*!< (@ 0x00000000) Counter/Timer A0 interrupt based on COMPR0.                */
      __IOM uint32_t CTMRB0C0INT : 1;           /*!< (@ 0x00000001) Counter/Timer B0 interrupt based on COMPR0.                */
      __IOM uint32_t CTMRA1C0INT : 1;           /*!< (@ 0x00000002) Counter/Timer A1 interrupt based on COMPR0.                */
      __IOM uint32_t CTMRB1C0INT : 1;           /*!< (@ 0x00000003) Counter/Timer B1 interrupt based on COMPR0.                */
      __IOM uint32_t CTMRA2C0INT : 1;           /*!< (@ 0x00000004) Counter/Timer A2 interrupt based on COMPR0.                */
      __IOM uint32_t CTMRB2C0INT : 1;           /*!< (@ 0x00000005) Counter/Timer B2 interrupt based on COMPR0.                */
      __IOM uint32_t CTMRA3C0INT : 1;           /*!< (@ 0x00000006) Counter/Timer A3 interrupt based on COMPR0.                */
      __IOM uint32_t CTMRB3C0INT : 1;           /*!< (@ 0x00000007) Counter/Timer B3 interrupt based on COMPR0.                */
      __IOM uint32_t CTMRA0C1INT : 1;           /*!< (@ 0x00000008) Counter/Timer A0 interrupt based on COMPR1.                */
      __IOM uint32_t CTMRB0C1INT : 1;           /*!< (@ 0x00000009) Counter/Timer B0 interrupt based on COMPR1.                */
      __IOM uint32_t CTMRA1C1INT : 1;           /*!< (@ 0x0000000A) Counter/Timer A1 interrupt based on COMPR1.                */
      __IOM uint32_t CTMRB1C1INT : 1;           /*!< (@ 0x0000000B) Counter/Timer B1 interrupt based on COMPR1.                */
      __IOM uint32_t CTMRA2C1INT : 1;           /*!< (@ 0x0000000C) Counter/Timer A2 interrupt based on COMPR1.                */
      __IOM uint32_t CTMRB2C1INT : 1;           /*!< (@ 0x0000000D) Counter/Timer B2 interrupt based on COMPR1.                */
      __IOM uint32_t CTMRA3C1INT : 1;           /*!< (@ 0x0000000E) Counter/Timer A3 interrupt based on COMPR1.                */
      __IOM uint32_t CTMRB3C1INT : 1;           /*!< (@ 0x0000000F) Counter/Timer B3 interrupt based on COMPR1.                */
    } INTSET_b;
  } ;
  __IM  uint32_t  RESERVED4[60];
  
  union {
    __IOM uint32_t STMINTEN;                    /*!< (@ 0x00000300) STIMER Interrupt registers: Enable                         */
    
