apache/mynewt-core/hw/mcu/ambiq/apollo2/include/mcu/apollo2.h
    struct {
      __IOM uint32_t COMPAREA   : 1;            /*!< (@ 0x00000000) COUNTER is greater than or equal to COMPARE register
                                                                    A.                                                         */
      __IOM uint32_t COMPAREB   : 1;            /*!< (@ 0x00000001) COUNTER is greater than or equal to COMPARE register
                                                                    B.                                                         */
      __IOM uint32_t COMPAREC   : 1;            /*!< (@ 0x00000002) COUNTER is greater than or equal to COMPARE register
                                                                    C.                                                         */
      __IOM uint32_t COMPARED   : 1;            /*!< (@ 0x00000003) COUNTER is greater than or equal to COMPARE register
                                                                    D.                                                         */
      __IOM uint32_t COMPAREE   : 1;            /*!< (@ 0x00000004) COUNTER is greater than or equal to COMPARE register
                                                                    E.                                                         */
      __IOM uint32_t COMPAREF   : 1;            /*!< (@ 0x00000005) COUNTER is greater than or equal to COMPARE register
                                                                    F.                                                         */
      __IOM uint32_t COMPAREG   : 1;            /*!< (@ 0x00000006) COUNTER is greater than or equal to COMPARE register
                                                                    G.                                                         */
      __IOM uint32_t COMPAREH   : 1;            /*!< (@ 0x00000007) COUNTER is greater than or equal to COMPARE register
                                                                    H.                                                         */
      __IOM uint32_t OVERFLOW   : 1;            /*!< (@ 0x00000008) COUNTER over flowed from 0xFFFFFFFF back to 0x00000000.    */
      __IOM uint32_t CAPTUREA   : 1;            /*!< (@ 0x00000009) CAPTURE register A has grabbed the value in the
                                                                    counter                                                    */
      __IOM uint32_t CAPTUREB   : 1;            /*!< (@ 0x0000000A) CAPTURE register B has grabbed the value in the
                                                                    counter                                                    */
      __IOM uint32_t CAPTUREC   : 1;            /*!< (@ 0x0000000B) CAPTURE register C has grabbed the value in the
                                                                    counter                                                    */
      __IOM uint32_t CAPTURED   : 1;            /*!< (@ 0x0000000C) CAPTURE register D has grabbed the value in the
                                                                    counter                                                    */
    } STMINTEN_b;
  } ;
  
  union {
    __IOM uint32_t STMINTSTAT;                  /*!< (@ 0x00000304) STIMER Interrupt registers: Status                         */
    
    struct {
      __IOM uint32_t COMPAREA   : 1;            /*!< (@ 0x00000000) COUNTER is greater than or equal to COMPARE register
                                                                    A.                                                         */
      __IOM uint32_t COMPAREB   : 1;            /*!< (@ 0x00000001) COUNTER is greater than or equal to COMPARE register
                                                                    B.                                                         */
      __IOM uint32_t COMPAREC   : 1;            /*!< (@ 0x00000002) COUNTER is greater than or equal to COMPARE register
                                                                    C.                                                         */
      __IOM uint32_t COMPARED   : 1;            /*!< (@ 0x00000003) COUNTER is greater than or equal to COMPARE register
                                                                    D.                                                         */
      __IOM uint32_t COMPAREE   : 1;            /*!< (@ 0x00000004) COUNTER is greater than or equal to COMPARE register
                                                                    E.                                                         */
      __IOM uint32_t COMPAREF   : 1;            /*!< (@ 0x00000005) COUNTER is greater than or equal to COMPARE register
                                                                    F.                                                         */
      __IOM uint32_t COMPAREG   : 1;            /*!< (@ 0x00000006) COUNTER is greater than or equal to COMPARE register
                                                                    G.                                                         */
      __IOM uint32_t COMPAREH   : 1;            /*!< (@ 0x00000007) COUNTER is greater than or equal to COMPARE register
                                                                    H.                                                         */
      __IOM uint32_t OVERFLOW   : 1;            /*!< (@ 0x00000008) COUNTER over flowed from 0xFFFFFFFF back to 0x00000000.    */
      __IOM uint32_t CAPTUREA   : 1;            /*!< (@ 0x00000009) CAPTURE register A has grabbed the value in the
                                                                    counter                                                    */
      __IOM uint32_t CAPTUREB   : 1;            /*!< (@ 0x0000000A) CAPTURE register B has grabbed the value in the
                                                                    counter                                                    */
      __IOM uint32_t CAPTUREC   : 1;            /*!< (@ 0x0000000B) CAPTURE register C has grabbed the value in the
                                                                    counter                                                    */
      __IOM uint32_t CAPTURED   : 1;            /*!< (@ 0x0000000C) CAPTURE register D has grabbed the value in the
                                                                    counter                                                    */
    } STMINTSTAT_b;
  } ;
  
  union {
    __IOM uint32_t STMINTCLR;                   /*!< (@ 0x00000308) STIMER Interrupt registers: Clear                          */
    
