apache/mynewt-core/hw/mcu/ambiq/apollo2/include/mcu/apollo2.h
    struct {
      __IOM uint32_t IOM0IRQ    : 6;            /*!< (@ 0x00000000) IOMSTR0 IRQ pad select.                                    */
    } IOM0IRQ_b;
  } ;
  
  union {
    __IOM uint32_t IOM1IRQ;                     /*!< (@ 0x000000C4) IOM1 Flow Control IRQ Select                               */
    
    struct {
      __IOM uint32_t IOM1IRQ    : 6;            /*!< (@ 0x00000000) IOMSTR1 IRQ pad select.                                    */
    } IOM1IRQ_b;
  } ;
  
  union {
    __IOM uint32_t IOM2IRQ;                     /*!< (@ 0x000000C8) IOM2 Flow Control IRQ Select                               */
    
    struct {
      __IOM uint32_t IOM2IRQ    : 6;            /*!< (@ 0x00000000) IOMSTR2 IRQ pad select.                                    */
    } IOM2IRQ_b;
  } ;
  
  union {
    __IOM uint32_t IOM3IRQ;                     /*!< (@ 0x000000CC) IOM3 Flow Control IRQ Select                               */
    
    struct {
      __IOM uint32_t IOM3IRQ    : 6;            /*!< (@ 0x00000000) IOMSTR3 IRQ pad select.                                    */
    } IOM3IRQ_b;
  } ;
  
  union {
    __IOM uint32_t IOM4IRQ;                     /*!< (@ 0x000000D0) IOM4 Flow Control IRQ Select                               */
    
    struct {
      __IOM uint32_t IOM4IRQ    : 6;            /*!< (@ 0x00000000) IOMSTR4 IRQ pad select.                                    */
    } IOM4IRQ_b;
  } ;
  
  union {
    __IOM uint32_t IOM5IRQ;                     /*!< (@ 0x000000D4) IOM5 Flow Control IRQ Select                               */
    
    struct {
      __IOM uint32_t IOM5IRQ    : 6;            /*!< (@ 0x00000000) IOMSTR5 IRQ pad select.                                    */
    } IOM5IRQ_b;
  } ;
  
  union {
    __IOM uint32_t LOOPBACK;                    /*!< (@ 0x000000D8) IOM to IOS Loopback Control                                */
    
    struct {
      __IOM uint32_t LOOPBACK   : 3;            /*!< (@ 0x00000000) IOM to IOS loopback control.                               */
    } LOOPBACK_b;
  } ;
  
  union {
    __IOM uint32_t GPIOOBS;                     /*!< (@ 0x000000DC) GPIO Observation Mode Sample register                      */
    
    struct {
      __IOM uint32_t OBS_DATA   : 16;           /*!< (@ 0x00000000) Sample of the data output on the GPIO observation
                                                                    port. May have async sampling issues, as
                                                                    the data is not synronized to the read
                                                                    operation. Intended for debug purposes
                                                                    only                                                       */
    } GPIOOBS_b;
  } ;
  
  union {
    __IOM uint32_t ALTPADCFGA;                  /*!< (@ 0x000000E0) Alternate Pad Configuration reg0 (Pads 3,2,1,0)            */
    
    struct {
      __IOM uint32_t PAD0_DS1   : 1;            /*!< (@ 0x00000000) Pad 0 high order drive strength selection. Used
                                                                    in conjunction with PAD0STRNG field to
                                                                    set the pad drive strength.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD0_SR    : 1;            /*!< (@ 0x00000004) Pad 0 slew rate selection.                                 */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD1_DS1   : 1;            /*!< (@ 0x00000008) Pad 1 high order drive strength selection. Used
                                                                    in conjunction with PAD1STRNG field to
                                                                    set the pad drive strength.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD1_SR    : 1;            /*!< (@ 0x0000000C) Pad 1 slew rate selection.                                 */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD2_DS1   : 1;            /*!< (@ 0x00000010) Pad 2 high order drive strength selection. Used
                                                                    in conjunction with PAD2STRNG field to
                                                                    set the pad drive strength.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD2_SR    : 1;            /*!< (@ 0x00000014) Pad 2 slew rate selection.                                 */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD3_DS1   : 1;            /*!< (@ 0x00000018) Pad 3 high order drive strength selection. Used
                                                                    in conjunction with PAD3STRNG field to
                                                                    set the pad drive strength.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD3_SR    : 1;            /*!< (@ 0x0000001C) Pad 3 slew rate selection.                                 */
    } ALTPADCFGA_b;
  } ;
  
  union {
    __IOM uint32_t ALTPADCFGB;                  /*!< (@ 0x000000E4) Alternate Pad Configuration reg1 (Pads 7,6,5,4)            */
    
    struct {
      __IOM uint32_t PAD4_DS1   : 1;            /*!< (@ 0x00000000) Pad 4 high order drive strength selection. Used
                                                                    in conjunction with PAD4STRNG field to
                                                                    set the pad drive strength.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD4_SR    : 1;            /*!< (@ 0x00000004) Pad 4 slew rate selection.                                 */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD5_DS1   : 1;            /*!< (@ 0x00000008) Pad 5 high order drive strength selection. Used
                                                                    in conjunction with PAD5STRNG field to
                                                                    set the pad drive strength.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD5_SR    : 1;            /*!< (@ 0x0000000C) Pad 5 slew rate selection.                                 */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD6_DS1   : 1;            /*!< (@ 0x00000010) Pad 6 high order drive strength selection. Used
                                                                    in conjunction with PAD6STRNG field to
                                                                    set the pad drive strength.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD6_SR    : 1;            /*!< (@ 0x00000014) Pad 6 slew rate selection.                                 */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD7_DS1   : 1;            /*!< (@ 0x00000018) Pad 7 high order drive strength selection. Used
                                                                    in conjunction with PAD7STRNG field to
                                                                    set the pad drive strength.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD7_SR    : 1;            /*!< (@ 0x0000001C) Pad 7 slew rate selection.                                 */
    } ALTPADCFGB_b;
  } ;
  
  union {
    __IOM uint32_t ALTPADCFGC;                  /*!< (@ 0x000000E8) Alternate Pad Configuration reg2 (Pads 11,10,9,8)          */
    
