apache/mynewt-core/hw/mcu/ambiq/apollo2/include/mcu/apollo2.h
    struct {
      __IOM uint32_t PAD8_DS1   : 1;            /*!< (@ 0x00000000) Pad 8 high order drive strength selection. Used
                                                                    in conjunction with PAD8STRNG field to
                                                                    set the pad drive strength.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD8_SR    : 1;            /*!< (@ 0x00000004) Pad 8 slew rate selection.                                 */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD9_DS1   : 1;            /*!< (@ 0x00000008) Pad 9 high order drive strength selection. Used
                                                                    in conjunction with PAD9STRNG field to
                                                                    set the pad drive strength.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD9_SR    : 1;            /*!< (@ 0x0000000C) Pad 9 slew rate selection.                                 */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD10_DS1  : 1;            /*!< (@ 0x00000010) Pad 10 high order drive strength selection. Used
                                                                    in conjunction with PAD10STRNG field to
                                                                    set the pad drive strength.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD10_SR   : 1;            /*!< (@ 0x00000014) Pad 10 slew rate selection.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD11_DS1  : 1;            /*!< (@ 0x00000018) Pad 11 high order drive strength selection. Used
                                                                    in conjunction with PAD11STRNG field to
                                                                    set the pad drive strength.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD11_SR   : 1;            /*!< (@ 0x0000001C) Pad 11 slew rate selection.                                */
    } ALTPADCFGC_b;
  } ;
  
  union {
    __IOM uint32_t ALTPADCFGD;                  /*!< (@ 0x000000EC) Alternate Pad Configuration reg3 (Pads 15,14,13,12)        */
    
    struct {
      __IOM uint32_t PAD12_DS1  : 1;            /*!< (@ 0x00000000) Pad 12 high order drive strength selection. Used
                                                                    in conjunction with PAD12STRNG field to
                                                                    set the pad drive strength.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD12_SR   : 1;            /*!< (@ 0x00000004) Pad 12 slew rate selection.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD13_DS1  : 1;            /*!< (@ 0x00000008) Pad 13 high order drive strength selection. Used
                                                                    in conjunction with PAD13STRNG field to
                                                                    set the pad drive strength.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD13_SR   : 1;            /*!< (@ 0x0000000C) Pad 13 slew rate selection.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD14_DS1  : 1;            /*!< (@ 0x00000010) Pad 14 high order drive strength selection. Used
                                                                    in conjunction with PAD14STRNG field to
                                                                    set the pad drive strength.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD14_SR   : 1;            /*!< (@ 0x00000014) Pad 14 slew rate selection.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD15_DS1  : 1;            /*!< (@ 0x00000018) Pad 15 high order drive strength selection. Used
                                                                    in conjunction with PAD15STRNG field to
                                                                    set the pad drive strength.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD15_SR   : 1;            /*!< (@ 0x0000001C) Pad 15 slew rate selection.                                */
    } ALTPADCFGD_b;
  } ;
  
  union {
    __IOM uint32_t ALTPADCFGE;                  /*!< (@ 0x000000F0) Alternate Pad Configuration reg4 (Pads 19,18,17,16)        */
    
    struct {
      __IOM uint32_t PAD16_DS1  : 1;            /*!< (@ 0x00000000) Pad 16 high order drive strength selection. Used
                                                                    in conjunction with PAD16STRNG field to
                                                                    set the pad drive strength.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD16_SR   : 1;            /*!< (@ 0x00000004) Pad 16 slew rate selection.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD17_DS1  : 1;            /*!< (@ 0x00000008) Pad 17 high order drive strength selection. Used
                                                                    in conjunction with PAD17STRNG field to
                                                                    set the pad drive strength.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD17_SR   : 1;            /*!< (@ 0x0000000C) Pad 17 slew rate selection.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD18_DS1  : 1;            /*!< (@ 0x00000010) Pad 18 high order drive strength selection. Used
                                                                    in conjunction with PAD18STRNG field to
                                                                    set the pad drive strength.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD18_SR   : 1;            /*!< (@ 0x00000014) Pad 18 slew rate selection.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD19_DS1  : 1;            /*!< (@ 0x00000018) Pad 19 high order drive strength selection. Used
                                                                    in conjunction with PAD19STRNG field to
                                                                    set the pad drive strength.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD19_SR   : 1;            /*!< (@ 0x0000001C) Pad 19 slew rate selection.                                */
    } ALTPADCFGE_b;
  } ;
  
  union {
    __IOM uint32_t ALTPADCFGF;                  /*!< (@ 0x000000F4) Alternate Pad Configuration reg5 (Pads 23,22,21,20)        */
    
