apache/mynewt-core/hw/mcu/ambiq/apollo2/include/mcu/apollo2.h
    struct {
      __IOM uint32_t PAD20_DS1  : 1;            /*!< (@ 0x00000000) Pad 20 high order drive strength selection. Used
                                                                    in conjunction with PAD20STRNG field to
                                                                    set the pad drive strength.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD20_SR   : 1;            /*!< (@ 0x00000004) Pad 20 slew rate selection.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD21_DS1  : 1;            /*!< (@ 0x00000008) Pad 21 high order drive strength selection. Used
                                                                    in conjunction with PAD21STRNG field to
                                                                    set the pad drive strength.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD21_SR   : 1;            /*!< (@ 0x0000000C) Pad 21 slew rate selection.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD22_DS1  : 1;            /*!< (@ 0x00000010) Pad 22 high order drive strength selection. Used
                                                                    in conjunction with PAD22STRNG field to
                                                                    set the pad drive strength.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD22_SR   : 1;            /*!< (@ 0x00000014) Pad 22 slew rate selection.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD23_DS1  : 1;            /*!< (@ 0x00000018) Pad 23 high order drive strength selection. Used
                                                                    in conjunction with PAD23STRNG field to
                                                                    set the pad drive strength.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD23_SR   : 1;            /*!< (@ 0x0000001C) Pad 23 slew rate selection.                                */
    } ALTPADCFGF_b;
  } ;
  
  union {
    __IOM uint32_t ALTPADCFGG;                  /*!< (@ 0x000000F8) Alternate Pad Configuration reg6 (Pads 27,26,25,24)        */
    
    struct {
      __IOM uint32_t PAD24_DS1  : 1;            /*!< (@ 0x00000000) Pad 24 high order drive strength selection. Used
                                                                    in conjunction with PAD24STRNG field to
                                                                    set the pad drive strength.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD24_SR   : 1;            /*!< (@ 0x00000004) Pad 24 slew rate selection.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD25_DS1  : 1;            /*!< (@ 0x00000008) Pad 25 high order drive strength selection. Used
                                                                    in conjunction with PAD25STRNG field to
                                                                    set the pad drive strength.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD25_SR   : 1;            /*!< (@ 0x0000000C) Pad 25 slew rate selection.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD26_DS1  : 1;            /*!< (@ 0x00000010) Pad 26 high order drive strength selection. Used
                                                                    in conjunction with PAD26STRNG field to
                                                                    set the pad drive strength.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD26_SR   : 1;            /*!< (@ 0x00000014) Pad 26 slew rate selection.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD27_DS1  : 1;            /*!< (@ 0x00000018) Pad 27 high order drive strength selection. Used
                                                                    in conjunction with PAD27STRNG field to
                                                                    set the pad drive strength.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD27_SR   : 1;            /*!< (@ 0x0000001C) Pad 27 slew rate selection.                                */
    } ALTPADCFGG_b;
  } ;
  
  union {
    __IOM uint32_t ALTPADCFGH;                  /*!< (@ 0x000000FC) Alternate Pad Configuration reg7 (Pads 31,30,29,28)        */
    
    struct {
      __IOM uint32_t PAD28_DS1  : 1;            /*!< (@ 0x00000000) Pad 28 high order drive strength selection. Used
                                                                    in conjunction with PAD28STRNG field to
                                                                    set the pad drive strength.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD28_SR   : 1;            /*!< (@ 0x00000004) Pad 28 slew rate selection.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD29_DS1  : 1;            /*!< (@ 0x00000008) Pad 29 high order drive strength selection. Used
                                                                    in conjunction with PAD29STRNG field to
                                                                    set the pad drive strength.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD29_SR   : 1;            /*!< (@ 0x0000000C) Pad 29 slew rate selection.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD30_DS1  : 1;            /*!< (@ 0x00000010) Pad 30 high order drive strength selection. Used
                                                                    in conjunction with PAD30STRNG field to
                                                                    set the pad drive strength.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD30_SR   : 1;            /*!< (@ 0x00000014) Pad 30 slew rate selection.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD31_DS1  : 1;            /*!< (@ 0x00000018) Pad 31 high order drive strength selection. Used
                                                                    in conjunction with PAD31STRNG field to
                                                                    set the pad drive strength.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD31_SR   : 1;            /*!< (@ 0x0000001C) Pad 31 slew rate selection.                                */
    } ALTPADCFGH_b;
  } ;
  
  union {
    __IOM uint32_t ALTPADCFGI;                  /*!< (@ 0x00000100) Alternate Pad Configuration reg8 (Pads 35,34,33,32)        */
    
