apache/mynewt-core/hw/mcu/ambiq/apollo2/include/mcu/apollo2.h
    struct {
      __IOM uint32_t PAD32_DS1  : 1;            /*!< (@ 0x00000000) Pad 32 high order drive strength selection. Used
                                                                    in conjunction with PAD32STRNG field to
                                                                    set the pad drive strength.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD32_SR   : 1;            /*!< (@ 0x00000004) Pad 32 slew rate selection.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD33_DS1  : 1;            /*!< (@ 0x00000008) Pad 33 high order drive strength selection. Used
                                                                    in conjunction with PAD33STRNG field to
                                                                    set the pad drive strength.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD33_SR   : 1;            /*!< (@ 0x0000000C) Pad 33 slew rate selection.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD34_DS1  : 1;            /*!< (@ 0x00000010) Pad 34 high order drive strength selection. Used
                                                                    in conjunction with PAD34STRNG field to
                                                                    set the pad drive strength.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD34_SR   : 1;            /*!< (@ 0x00000014) Pad 34 slew rate selection.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD35_DS1  : 1;            /*!< (@ 0x00000018) Pad 35 high order drive strength selection. Used
                                                                    in conjunction with PAD35STRNG field to
                                                                    set the pad drive strength.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD35_SR   : 1;            /*!< (@ 0x0000001C) Pad 35 slew rate selection.                                */
    } ALTPADCFGI_b;
  } ;
  
  union {
    __IOM uint32_t ALTPADCFGJ;                  /*!< (@ 0x00000104) Alternate Pad Configuration reg9 (Pads 39,38,37,36)        */
    
    struct {
      __IOM uint32_t PAD36_DS1  : 1;            /*!< (@ 0x00000000) Pad 36 high order drive strength selection. Used
                                                                    in conjunction with PAD36STRNG field to
                                                                    set the pad drive strength.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD36_SR   : 1;            /*!< (@ 0x00000004) Pad 36 slew rate selection.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD37_DS1  : 1;            /*!< (@ 0x00000008) Pad 37 high order drive strength selection. Used
                                                                    in conjunction with PAD37STRNG field to
                                                                    set the pad drive strength.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD37_SR   : 1;            /*!< (@ 0x0000000C) Pad 37 slew rate selection.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD38_DS1  : 1;            /*!< (@ 0x00000010) Pad 38 high order drive strength selection. Used
                                                                    in conjunction with PAD38STRNG field to
                                                                    set the pad drive strength.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD38_SR   : 1;            /*!< (@ 0x00000014) Pad 38 slew rate selection.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD39_DS1  : 1;            /*!< (@ 0x00000018) Pad 39 high order drive strength selection. Used
                                                                    in conjunction with PAD39STRNG field to
                                                                    set the pad drive strength.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD39_SR   : 1;            /*!< (@ 0x0000001C) Pad 39 slew rate selection.                                */
    } ALTPADCFGJ_b;
  } ;
  
  union {
    __IOM uint32_t ALTPADCFGK;                  /*!< (@ 0x00000108) Alternate Pad Configuration reg10 (Pads 43,42,41,40)       */
    
    struct {
      __IOM uint32_t PAD40_DS1  : 1;            /*!< (@ 0x00000000) Pad 40 high order drive strength selection. Used
                                                                    in conjunction with PAD40STRNG field to
                                                                    set the pad drive strength.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD40_SR   : 1;            /*!< (@ 0x00000004) Pad 40 slew rate selection.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD41_DS1  : 1;            /*!< (@ 0x00000008) Pad 41 high order drive strength selection. Used
                                                                    in conjunction with PAD41STRNG field to
                                                                    set the pad drive strength.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD41_SR   : 1;            /*!< (@ 0x0000000C) Pad 41 slew rate selection.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD42_DS1  : 1;            /*!< (@ 0x00000010) Pad 42 high order drive strength selection. Used
                                                                    in conjunction with PAD42STRNG field to
                                                                    set the pad drive strength.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD42_SR   : 1;            /*!< (@ 0x00000014) Pad 42 slew rate selection.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD43_DS1  : 1;            /*!< (@ 0x00000018) Pad 43 high order drive strength selection. Used
                                                                    in conjunction with PAD43STRNG field to
                                                                    set the pad drive strength.                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD43_SR   : 1;            /*!< (@ 0x0000001C) Pad 43 slew rate selection.                                */
    } ALTPADCFGK_b;
  } ;
  
  union {
    __IOM uint32_t ALTPADCFGL;                  /*!< (@ 0x0000010C) Alternate Pad Configuration reg11 (Pads 47,46,45,44)       */
    
