apache/mynewt-core/hw/mcu/ambiq/apollo2/include/mcu/apollo2.h
    struct {
      __IOM uint32_t FIFO       : 32;           /*!< (@ 0x00000000) FIFO access port.                                          */
    } FIFO_b;
  } ;
  __IM  uint32_t  RESERVED[63];
  
  union {
    __IOM uint32_t FIFOPTR;                     /*!< (@ 0x00000100) Current FIFO Pointers                                      */
    
    struct {
      __IOM uint32_t FIFOSIZ    : 8;            /*!< (@ 0x00000000) The number of bytes currently in the FIFO.                 */
      __IM  uint32_t            : 8;
      __IOM uint32_t FIFOREM    : 8;            /*!< (@ 0x00000010) The number of bytes remaining in the FIFO (i.e.
                                                                    128-FIFOSIZ if FULLDUP = 0 or 64-FIFOSIZ
                                                                    if FULLDUP = 1)).                                          */
    } FIFOPTR_b;
  } ;
  
  union {
    __IOM uint32_t TLNGTH;                      /*!< (@ 0x00000104) Transfer Length                                            */
    
    struct {
      __IOM uint32_t TLNGTH     : 12;           /*!< (@ 0x00000000) Remaining transfer length.                                 */
    } TLNGTH_b;
  } ;
  
  union {
    __IOM uint32_t FIFOTHR;                     /*!< (@ 0x00000108) FIFO Threshold Configuration                               */
    
    struct {
      __IOM uint32_t FIFORTHR   : 7;            /*!< (@ 0x00000000) FIFO read threshold.                                       */
      __IM  uint32_t            : 1;
      __IOM uint32_t FIFOWTHR   : 7;            /*!< (@ 0x00000008) FIFO write threshold.                                      */
    } FIFOTHR_b;
  } ;
  
  union {
    __IOM uint32_t CLKCFG;                      /*!< (@ 0x0000010C) I/O Clock Configuration                                    */
    
    struct {
      __IM  uint32_t            : 8;
      __IOM uint32_t FSEL       : 3;            /*!< (@ 0x00000008) Select the input clock frequency.                          */
      __IOM uint32_t DIV3       : 1;            /*!< (@ 0x0000000B) Enable divide by 3.                                        */
      __IOM uint32_t DIVEN      : 1;            /*!< (@ 0x0000000C) Enable clock division by TOTPER.                           */
      __IM  uint32_t            : 3;
      __IOM uint32_t LOWPER     : 8;            /*!< (@ 0x00000010) Clock low count minus 1.                                   */
      __IOM uint32_t TOTPER     : 8;            /*!< (@ 0x00000018) Clock total count minus 1.                                 */
    } CLKCFG_b;
  } ;
  
  union {
    __IOM uint32_t CMD;                         /*!< (@ 0x00000110) Command Register                                           */
    
    struct {
      __IOM uint32_t CMD        : 32;           /*!< (@ 0x00000000) This register holds the I/O Command                        */
    } CMD_b;
  } ;
  
  union {
    __IOM uint32_t CMDRPT;                      /*!< (@ 0x00000114) Command Repeat Register                                    */
    
    struct {
      __IOM uint32_t CMDRPT     : 5;            /*!< (@ 0x00000000) These bits hold the Command repeat count.                  */
    } CMDRPT_b;
  } ;
  
  union {
    __IOM uint32_t STATUS;                      /*!< (@ 0x00000118) Status Register                                            */
    
    struct {
      __IOM uint32_t ERR        : 1;            /*!< (@ 0x00000000) This bit indicates if an error interrupt has
                                                                    occurred.                                                  */
      __IOM uint32_t CMDACT     : 1;            /*!< (@ 0x00000001) This bit indicates if the I/O Command is active.           */
      __IOM uint32_t IDLEST     : 1;            /*!< (@ 0x00000002) This bit indicates if the I/O state machine is
                                                                    IDLE.                                                      */
    } STATUS_b;
  } ;
  
  union {
    __IOM uint32_t CFG;                         /*!< (@ 0x0000011C) I/O Master Configuration                                   */
    
    struct {
      __IOM uint32_t IFCSEL     : 1;            /*!< (@ 0x00000000) This bit selects the I/O interface.                        */
      __IOM uint32_t SPOL       : 1;            /*!< (@ 0x00000001) This bit selects SPI polarity.                             */
      __IOM uint32_t SPHA       : 1;            /*!< (@ 0x00000002) This bit selects SPI phase.                                */
      __IOM uint32_t FULLDUP    : 1;            /*!< (@ 0x00000003) This bit selects full duplex mode.                         */
      __IOM uint32_t STARTRD    : 2;            /*!< (@ 0x00000004) This bit selects the preread timing.                       */
      __IM  uint32_t            : 2;
      __IOM uint32_t WTFC       : 1;            /*!< (@ 0x00000008) This bit enables write mode flow control.                  */
      __IOM uint32_t RDFC       : 1;            /*!< (@ 0x00000009) This bit enables read mode flow control.                   */
      __IOM uint32_t MOSIINV    : 1;            /*!< (@ 0x0000000A) This bit invewrts MOSI when flow control is enabled.       */
      __IOM uint32_t FCDEL      : 1;            /*!< (@ 0x0000000B) This bit must be left at the default value of
                                                                    0.                                                         */
      __IOM uint32_t WTFCIRQ    : 1;            /*!< (@ 0x0000000C) This bit selects the write mode flow control
                                                                    signal.                                                    */
      __IOM uint32_t WTFCPOL    : 1;            /*!< (@ 0x0000000D) This bit selects the write flow control signal
                                                                    polarity.                                                  */
      __IOM uint32_t RDFCPOL    : 1;            /*!< (@ 0x0000000E) This bit selects the read flow control signal
                                                                    polarity.                                                  */
      __IM  uint32_t            : 16;
      __IOM uint32_t IFCEN      : 1;            /*!< (@ 0x0000001F) This bit enables the IO Master.                            */
    } CFG_b;
  } ;
  __IM  uint32_t  RESERVED1[56];
  
  union {
    __IOM uint32_t INTEN;                       /*!< (@ 0x00000200) IO Master Interrupts: Enable                               */
    
