apache/mynewt-core/hw/mcu/ambiq/apollo2/include/mcu/apollo2.h
    struct {
      __IOM uint32_t CMDCMP     : 1;            /*!< (@ 0x00000000) This is the Command Complete interrupt.                    */
      __IOM uint32_t THR        : 1;            /*!< (@ 0x00000001) This is the FIFO Threshold interrupt.                      */
      __IOM uint32_t FUNDFL     : 1;            /*!< (@ 0x00000002) This is the Read FIFO Underflow interrupt. An
                                                                    attempt was made to read FIFO when empty
                                                                    (i.e. while FIFOSIZ less than 4).                          */
      __IOM uint32_t FOVFL      : 1;            /*!< (@ 0x00000003) This is the Write FIFO Overflow interrupt. An
                                                                    attempt was made to write the FIFO while
                                                                    it was full (i.e. while FIFOSIZ > 124).                    */
      __IOM uint32_t NAK        : 1;            /*!< (@ 0x00000004) This is the I2C NAK interrupt. The expected ACK
                                                                    from the slave was not received by the
                                                                    IOM.                                                       */
      __IOM uint32_t WTLEN      : 1;            /*!< (@ 0x00000005) This is the WTLEN interrupt.                               */
      __IOM uint32_t IACC       : 1;            /*!< (@ 0x00000006) This is the illegal FIFO access interrupt. An
                                                                    attempt was made to read the FIFO during
                                                                    a write CMD. Or an attempt was made to
                                                                    write the FIFO on a read CMD.                              */
      __IOM uint32_t ICMD       : 1;            /*!< (@ 0x00000007) This is the illegal command interrupt. Software
                                                                    attempted to issue a CMD while another
                                                                    CMD was already in progress. Or an attempt
                                                                    was made to issue a non-zero-length write
                                                                    CMD with an empty FIFO.                                    */
      __IOM uint32_t START      : 1;            /*!< (@ 0x00000008) This is the START command interrupt. A START
                                                                    from another master was detected. Software
                                                                    must wait for a STOP before proceeding.                    */
      __IOM uint32_t STOP       : 1;            /*!< (@ 0x00000009) This is the STOP command interrupt. A STOP bit
                                                                    was detected by the IOM.                                   */
      __IOM uint32_t ARB        : 1;            /*!< (@ 0x0000000A) This is the arbitration loss interrupt. This
                                                                    error occurs if another master collides
                                                                    with an IO Master transfer. Generally,
                                                                    the IOM started an operation but found
                                                                    SDA already low.                                           */
    } INTCLR_b;
  } ;
  
  union {
    __IOM uint32_t INTSET;                      /*!< (@ 0x0000020C) IO Master Interrupts: Set                                  */
    
    struct {
      __IOM uint32_t CMDCMP     : 1;            /*!< (@ 0x00000000) This is the Command Complete interrupt.                    */
      __IOM uint32_t THR        : 1;            /*!< (@ 0x00000001) This is the FIFO Threshold interrupt.                      */
      __IOM uint32_t FUNDFL     : 1;            /*!< (@ 0x00000002) This is the Read FIFO Underflow interrupt. An
                                                                    attempt was made to read FIFO when empty
                                                                    (i.e. while FIFOSIZ less than 4).                          */
      __IOM uint32_t FOVFL      : 1;            /*!< (@ 0x00000003) This is the Write FIFO Overflow interrupt. An
                                                                    attempt was made to write the FIFO while
                                                                    it was full (i.e. while FIFOSIZ > 124).                    */
      __IOM uint32_t NAK        : 1;            /*!< (@ 0x00000004) This is the I2C NAK interrupt. The expected ACK
                                                                    from the slave was not received by the
                                                                    IOM.                                                       */
      __IOM uint32_t WTLEN      : 1;            /*!< (@ 0x00000005) This is the WTLEN interrupt.                               */
      __IOM uint32_t IACC       : 1;            /*!< (@ 0x00000006) This is the illegal FIFO access interrupt. An
                                                                    attempt was made to read the FIFO during
                                                                    a write CMD. Or an attempt was made to
                                                                    write the FIFO on a read CMD.                              */
      __IOM uint32_t ICMD       : 1;            /*!< (@ 0x00000007) This is the illegal command interrupt. Software
                                                                    attempted to issue a CMD while another
                                                                    CMD was already in progress. Or an attempt
                                                                    was made to issue a non-zero-length write
                                                                    CMD with an empty FIFO.                                    */
      __IOM uint32_t START      : 1;            /*!< (@ 0x00000008) This is the START command interrupt. A START
                                                                    from another master was detected. Software
                                                                    must wait for a STOP before proceeding.                    */
      __IOM uint32_t STOP       : 1;            /*!< (@ 0x00000009) This is the STOP command interrupt. A STOP bit
                                                                    was detected by the IOM.                                   */
      __IOM uint32_t ARB        : 1;            /*!< (@ 0x0000000A) This is the arbitration loss interrupt. This
                                                                    error occurs if another master collides
                                                                    with an IO Master transfer. Generally,
                                                                    the IOM started an operation but found
                                                                    SDA already low.                                           */
    } INTSET_b;
  } ;
} IOMSTR0_Type;                                 /*!< Size = 528 (0x210)                                                        */



/* =========================================================================================================================== */
/* ================                                          IOSLAVE                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief I2C/SPI Slave (IOSLAVE)
  */

typedef struct {                                /*!< (@ 0x50000000) IOSLAVE Structure                                          */
  __IM  uint32_t  RESERVED[64];
  
  union {
    __IOM uint32_t FIFOPTR;                     /*!< (@ 0x00000100) Current FIFO Pointer                                       */
    
