apache/mynewt-core/hw/mcu/ambiq/apollo2/include/mcu/apollo2.h
    struct {
      __IOM uint32_t GADATA     : 8;            /*!< (@ 0x00000000) The data supplied on the last General Address
                                                                    reference.                                                 */
    } GENADD_b;
  } ;
  __IM  uint32_t  RESERVED1[54];
  
  union {
    __IOM uint32_t INTEN;                       /*!< (@ 0x00000200) IO Slave Interrupts: Enable                                */
    
    struct {
      __IOM uint32_t FSIZE      : 1;            /*!< (@ 0x00000000) FIFO Size interrupt.                                       */
      __IOM uint32_t FOVFL      : 1;            /*!< (@ 0x00000001) FIFO Overflow interrupt.                                   */
      __IOM uint32_t FUNDFL     : 1;            /*!< (@ 0x00000002) FIFO Underflow interrupt.                                  */
      __IOM uint32_t FRDERR     : 1;            /*!< (@ 0x00000003) FIFO Read Error interrupt.                                 */
      __IOM uint32_t GENAD      : 1;            /*!< (@ 0x00000004) I2C General Address interrupt.                             */
      __IOM uint32_t IOINTW     : 1;            /*!< (@ 0x00000005) I2C Interrupt Write interrupt.                             */
      __IOM uint32_t XCMPRF     : 1;            /*!< (@ 0x00000006) Transfer complete interrupt, read from FIFO space.         */
      __IOM uint32_t XCMPRR     : 1;            /*!< (@ 0x00000007) Transfer complete interrupt, read from register
                                                                    space.                                                     */
      __IOM uint32_t XCMPWF     : 1;            /*!< (@ 0x00000008) Transfer complete interrupt, write to FIFO space.          */
      __IOM uint32_t XCMPWR     : 1;            /*!< (@ 0x00000009) Transfer complete interrupt, write to register
                                                                    space.                                                     */
    } INTEN_b;
  } ;
  
  union {
    __IOM uint32_t INTSTAT;                     /*!< (@ 0x00000204) IO Slave Interrupts: Status                                */
    
    struct {
      __IOM uint32_t FSIZE      : 1;            /*!< (@ 0x00000000) FIFO Size interrupt.                                       */
      __IOM uint32_t FOVFL      : 1;            /*!< (@ 0x00000001) FIFO Overflow interrupt.                                   */
      __IOM uint32_t FUNDFL     : 1;            /*!< (@ 0x00000002) FIFO Underflow interrupt.                                  */
      __IOM uint32_t FRDERR     : 1;            /*!< (@ 0x00000003) FIFO Read Error interrupt.                                 */
      __IOM uint32_t GENAD      : 1;            /*!< (@ 0x00000004) I2C General Address interrupt.                             */
      __IOM uint32_t IOINTW     : 1;            /*!< (@ 0x00000005) I2C Interrupt Write interrupt.                             */
      __IOM uint32_t XCMPRF     : 1;            /*!< (@ 0x00000006) Transfer complete interrupt, read from FIFO space.         */
      __IOM uint32_t XCMPRR     : 1;            /*!< (@ 0x00000007) Transfer complete interrupt, read from register
                                                                    space.                                                     */
      __IOM uint32_t XCMPWF     : 1;            /*!< (@ 0x00000008) Transfer complete interrupt, write to FIFO space.          */
      __IOM uint32_t XCMPWR     : 1;            /*!< (@ 0x00000009) Transfer complete interrupt, write to register
                                                                    space.                                                     */
    } INTSTAT_b;
  } ;
  
  union {
    __IOM uint32_t INTCLR;                      /*!< (@ 0x00000208) IO Slave Interrupts: Clear                                 */
    
    struct {
      __IOM uint32_t FSIZE      : 1;            /*!< (@ 0x00000000) FIFO Size interrupt.                                       */
      __IOM uint32_t FOVFL      : 1;            /*!< (@ 0x00000001) FIFO Overflow interrupt.                                   */
      __IOM uint32_t FUNDFL     : 1;            /*!< (@ 0x00000002) FIFO Underflow interrupt.                                  */
      __IOM uint32_t FRDERR     : 1;            /*!< (@ 0x00000003) FIFO Read Error interrupt.                                 */
      __IOM uint32_t GENAD      : 1;            /*!< (@ 0x00000004) I2C General Address interrupt.                             */
      __IOM uint32_t IOINTW     : 1;            /*!< (@ 0x00000005) I2C Interrupt Write interrupt.                             */
      __IOM uint32_t XCMPRF     : 1;            /*!< (@ 0x00000006) Transfer complete interrupt, read from FIFO space.         */
      __IOM uint32_t XCMPRR     : 1;            /*!< (@ 0x00000007) Transfer complete interrupt, read from register
                                                                    space.                                                     */
      __IOM uint32_t XCMPWF     : 1;            /*!< (@ 0x00000008) Transfer complete interrupt, write to FIFO space.          */
      __IOM uint32_t XCMPWR     : 1;            /*!< (@ 0x00000009) Transfer complete interrupt, write to register
                                                                    space.                                                     */
    } INTCLR_b;
  } ;
  
  union {
    __IOM uint32_t INTSET;                      /*!< (@ 0x0000020C) IO Slave Interrupts: Set                                   */
    
    struct {
      __IOM uint32_t FSIZE      : 1;            /*!< (@ 0x00000000) FIFO Size interrupt.                                       */
      __IOM uint32_t FOVFL      : 1;            /*!< (@ 0x00000001) FIFO Overflow interrupt.                                   */
      __IOM uint32_t FUNDFL     : 1;            /*!< (@ 0x00000002) FIFO Underflow interrupt.                                  */
      __IOM uint32_t FRDERR     : 1;            /*!< (@ 0x00000003) FIFO Read Error interrupt.                                 */
      __IOM uint32_t GENAD      : 1;            /*!< (@ 0x00000004) I2C General Address interrupt.                             */
      __IOM uint32_t IOINTW     : 1;            /*!< (@ 0x00000005) I2C Interrupt Write interrupt.                             */
      __IOM uint32_t XCMPRF     : 1;            /*!< (@ 0x00000006) Transfer complete interrupt, read from FIFO space.         */
      __IOM uint32_t XCMPRR     : 1;            /*!< (@ 0x00000007) Transfer complete interrupt, read from register
                                                                    space.                                                     */
      __IOM uint32_t XCMPWF     : 1;            /*!< (@ 0x00000008) Transfer complete interrupt, write to FIFO space.          */
      __IOM uint32_t XCMPWR     : 1;            /*!< (@ 0x00000009) Transfer complete interrupt, write to register
                                                                    space.                                                     */
    } INTSET_b;
  } ;
  
  union {
    __IOM uint32_t REGACCINTEN;                 /*!< (@ 0x00000210) Register Access Interrupts: Enable                         */
    
