apache/mynewt-core/hw/mcu/ambiq/apollo2/include/mcu/apollo2.h
    struct {
      __IOM uint32_t REGACC     : 32;           /*!< (@ 0x00000000) Register access interrupts.                                */
    } REGACCINTEN_b;
  } ;
  
  union {
    __IOM uint32_t REGACCINTSTAT;               /*!< (@ 0x00000214) Register Access Interrupts: Status                         */
    
    struct {
      __IOM uint32_t REGACC     : 32;           /*!< (@ 0x00000000) Register access interrupts.                                */
    } REGACCINTSTAT_b;
  } ;
  
  union {
    __IOM uint32_t REGACCINTCLR;                /*!< (@ 0x00000218) Register Access Interrupts: Clear                          */
    
    struct {
      __IOM uint32_t REGACC     : 32;           /*!< (@ 0x00000000) Register access interrupts.                                */
    } REGACCINTCLR_b;
  } ;
  
  union {
    __IOM uint32_t REGACCINTSET;                /*!< (@ 0x0000021C) Register Access Interrupts: Set                            */
    
    struct {
      __IOM uint32_t REGACC     : 32;           /*!< (@ 0x00000000) Register access interrupts.                                */
    } REGACCINTSET_b;
  } ;
} IOSLAVE_Type;                                 /*!< Size = 544 (0x220)                                                        */



/* =========================================================================================================================== */
/* ================                                          MCUCTRL                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief MCU Miscellaneous Control Logic (MCUCTRL)
  */

typedef struct {                                /*!< (@ 0x40020000) MCUCTRL Structure                                          */
  
  union {
    __IOM uint32_t CHIP_INFO;                   /*!< (@ 0x00000000) Chip Information Register                                  */
    
    struct {
      __IOM uint32_t PARTNUM    : 32;           /*!< (@ 0x00000000) BCD part number.                                           */
    } CHIP_INFO_b;
  } ;
  
  union {
    __IOM uint32_t CHIPID0;                     /*!< (@ 0x00000004) Unique Chip ID 0                                           */
    
    struct {
      __IOM uint32_t VALUE      : 32;           /*!< (@ 0x00000000) Unique chip ID 0.                                          */
    } CHIPID0_b;
  } ;
  
  union {
    __IOM uint32_t CHIPID1;                     /*!< (@ 0x00000008) Unique Chip ID 1                                           */
    
    struct {
      __IOM uint32_t VALUE      : 32;           /*!< (@ 0x00000000) Unique chip ID 1.                                          */
    } CHIPID1_b;
  } ;
  
  union {
    __IOM uint32_t CHIPREV;                     /*!< (@ 0x0000000C) Chip Revision                                              */
    
    struct {
      __IOM uint32_t REVMIN     : 4;            /*!< (@ 0x00000000) Minor Revision ID.                                         */
      __IOM uint32_t REVMAJ     : 4;            /*!< (@ 0x00000004) Major Revision ID.                                         */
    } CHIPREV_b;
  } ;
  
  union {
    __IOM uint32_t VENDORID;                    /*!< (@ 0x00000010) Unique Vendor ID                                           */
    
    struct {
      __IOM uint32_t VALUE      : 32;           /*!< (@ 0x00000000) Unique Vendor ID                                           */
    } VENDORID_b;
  } ;
  
  union {
    __IOM uint32_t DEBUGGER;                    /*!< (@ 0x00000014) Debugger Access Control                                    */
    
    struct {
      __IOM uint32_t LOCKOUT    : 1;            /*!< (@ 0x00000000) Lockout of debugger (SWD).                                 */
    } DEBUGGER_b;
  } ;
  __IM  uint32_t  RESERVED[18];
  
  union {
    __IOM uint32_t BUCK;                        /*!< (@ 0x00000060) Analog Buck Control                                        */
    
    struct {
      __IOM uint32_t BUCKSWE    : 1;            /*!< (@ 0x00000000) Buck Register Software Override Enable. This
                                                                    will enable the override values for MEMBUCKPWD,
                                                                    COREBUCKPWD, COREBUCKRST, MEMBUCKRST, all
                                                                    to be propagated to the control logic,
                                                                    instead of the normal power control module
                                                                    signal. Note - Must take care to have correct
                                                                    value for ALL the register bits when this
                                                                    SWE is enabled.                                            */
      __IOM uint32_t BYPBUCKCORE : 1;           /*!< (@ 0x00000001) Not used. Additional control of buck is available
                                                                    in the power control module                                */
      __IOM uint32_t COREBUCKPWD : 1;           /*!< (@ 0x00000002) Core buck power down override. 1=Powered Down;
                                                                    0=Enabled; Value is propagated only when
                                                                    the BUCKSWE bit is active, otherwise control
                                                                    is from the power control module.                          */
      __IOM uint32_t SLEEPBUCKANA : 1;          /*!< (@ 0x00000003) HFRC clkgen bit 0 override. When set, this will
                                                                    override to 0 bit 0 of the hfrc_freq_clkgen
                                                                    internal bus (see internal Shelby-1473)                    */
      __IOM uint32_t MEMBUCKPWD : 1;            /*!< (@ 0x00000004) Memory buck power down override. 1=Powered Down;
                                                                    0=Enabled; Value is propagated only when
                                                                    the BUCKSWE bit is active, otherwise control
                                                                    is from the power control module.                          */
      __IOM uint32_t BYPBUCKMEM : 1;            /*!< (@ 0x00000005) Not used. Additional control of buck is available
                                                                    in the power control module                                */
      __IOM uint32_t COREBUCKRST : 1;           /*!< (@ 0x00000006) Reset control override for Core Buck; 0=enabled,
                                                                    1=reset; Value is propagated only when
                                                                    the BUCKSWE bit is active, otherwise control
                                                                    is from the power control module.                          */
      __IOM uint32_t MEMBUCKRST : 1;            /*!< (@ 0x00000007) Reset control override for Mem Buck; 0=enabled,
                                                                    1=reset; Value is propagated only when
                                                                    the BUCKSWE bit is active, otherwise contrl
                                                                    is from the power control module.                          */
    } BUCK_b;
  } ;
  
  union {
    __IOM uint32_t BUCK2;                       /*!< (@ 0x00000064) Buck Control Reg2                                          */
    
