apache/mynewt-core/hw/mcu/ambiq/apollo2/include/mcu/apollo2.h
    struct {
      __IOM uint32_t BCORETONSEL : 4;           /*!< (@ 0x00000000) Core Buck low turn on trim                                 */
      __IOM uint32_t BMEMTONSEL : 4;            /*!< (@ 0x00000004) Flash Buck high turn on trim                               */
      __IOM uint32_t HYSTBUCKMEM : 1;           /*!< (@ 0x00000008) Enable/disable hysteresis on memory buck converters
                                                                    internal comparators.                                      */
      __IOM uint32_t HYSTBUCKCORE : 1;          /*!< (@ 0x00000009) Enable/disable hysteresis on core buck converters
                                                                    internal comparators.                                      */
      __IOM uint32_t BUCKLFCLKSEL : 2;          /*!< (@ 0x0000000A) Buck clkgen divider trim. 00 = 1.5MHz; 01 = 750kHz;
                                                                    10 = 375kHz; 11 = 187.5kHz                                 */
    } BUCK2_b;
  } ;
  
  union {
    __IOM uint32_t BUCK3;                       /*!< (@ 0x00000068) Buck control reg 3                                         */
    
    struct {
      __IOM uint32_t COREBUCKHYSTTRIM : 2;      /*!< (@ 0x00000000) Hysterisis trim for core buck                              */
      __IOM uint32_t COREBUCKZXTRIM : 4;        /*!< (@ 0x00000002) Core buck zero crossing trim value                         */
      __IOM uint32_t COREBUCKBURSTEN : 1;       /*!< (@ 0x00000006) Core Buck burst enable. 0=disabled, 1=enabled              */
      __IOM uint32_t COREBUCKLOTON : 4;         /*!< (@ 0x00000007) Core Buck low TON trim value                               */
      __IOM uint32_t MEMBUCKHYSTTRIM : 2;       /*!< (@ 0x0000000B) Hysterisis trim for mem buck                               */
      __IOM uint32_t MEMBUCKZXTRIM : 4;         /*!< (@ 0x0000000D) Memory buck zero crossing trim value                       */
      __IOM uint32_t MEMBUCKBURSTEN : 1;        /*!< (@ 0x00000011) MEM Buck burst enable 0=disable, 0=disabled,
                                                                    1=enable.                                                  */
      __IOM uint32_t MEMBUCKLOTON : 4;          /*!< (@ 0x00000012) MEM Buck low TON trim value                                */
    } BUCK3_b;
  } ;
  __IM  uint32_t  RESERVED1[5];
  
  union {
    __IOM uint32_t LDOREG1;                     /*!< (@ 0x00000080) Analog LDO Reg 1                                           */
    
    struct {
      __IOM uint32_t TRIMCORELDOR1 : 10;        /*!< (@ 0x00000000) CORE LDO Active mode ouput trim (R1).                      */
      __IOM uint32_t TRIMCORELDOR3 : 4;         /*!< (@ 0x0000000A) CORE LDO tempco trim (R3).                                 */
      __IOM uint32_t CORELDOLPTRIM : 6;         /*!< (@ 0x0000000E) CORE LDO Low Power Trim                                    */
      __IOM uint32_t CORELDOIBSTRM : 1;         /*!< (@ 0x00000014) CORE LDO IBIAS Trim                                        */
    } LDOREG1_b;
  } ;
  
  union {
    __IOM uint32_t LDOREG2;                     /*!< (@ 0x00000084) LDO Control Register 2                                     */
    
    struct {
      __IOM uint32_t LDO2SWE    : 1;            /*!< (@ 0x00000000) LDO2 Software Override Enable. If enabled (=1),
                                                                    this will enable the override values from
                                                                    this register to be used instead of the
                                                                    normal control signals for the following
                                                                    fields: CORELDOVDDLEN, RAMLDOLPMODE, PWDRAMLDO,
                                                                    PWDANALDO, PWDMEMLDO, PWDCORELDO, SLEEPANALDO,
                                                                    SLEEPMEMLDO, SLEEPCORELDO.                                 */
      __IOM uint32_t RAMLDOTRIM : 5;            /*!< (@ 0x00000001) RAM LDO TRIM                                               */
      __IOM uint32_t TRIMANALDO : 4;            /*!< (@ 0x00000006) Analog LDO Trim.                                           */
      __IOM uint32_t VREFSELCORELDO : 1;        /*!< (@ 0x0000000A) CONTROL BIT IS NOT USED. PLEASE TREAT AS RESERVED          */
      __IOM uint32_t VREFSELFLASHLDO : 1;       /*!< (@ 0x0000000B) CONTROL BIT IS NOT USED. PLEASE TREAT AS RESERVED          */
      __IOM uint32_t VREFSELSRAMLDO : 1;        /*!< (@ 0x0000000C) CONTROL BIT IS NOT USED. PLEASE TREAT AS RESERVED          */
      __IOM uint32_t VREFSELANALDO : 1;         /*!< (@ 0x0000000D) CONTROL BIT IS NOT USED. PLEASE TREAT AS RESERVED          */
      __IOM uint32_t SLEEPCORELDO : 1;          /*!< (@ 0x0000000E) CORE LDO Sleep. This value is propagated only
                                                                    when LDO2SWE bit is active(1).                             */
      __IOM uint32_t SLEEPMEMLDO : 1;           /*!< (@ 0x0000000F) FLASH LDO Sleep. This value is propagated only
                                                                    when LDO2SWE bit is active(1).                             */
      __IOM uint32_t SLEEPANALDO : 1;           /*!< (@ 0x00000010) Analog LDO Sleep. This value is propagated only
                                                                    when LDO2SWE bit is active(1).                             */
      __IOM uint32_t PWDCORELDO : 1;            /*!< (@ 0x00000011) CORE LDO Power Down. This value is propagated
                                                                    only when LDO2SWE bit is active(1).                        */
      __IOM uint32_t PWDMEMLDO  : 1;            /*!< (@ 0x00000012) MEM LDO Power Down. This value is propagated
                                                                    only when LDO2SWE bit is active(1).                        */
      __IOM uint32_t PWDANALDO  : 1;            /*!< (@ 0x00000013) Analog LDO Power Down. This value is propagated
                                                                    only when LDO2SWE bit is active(1).                        */
      __IOM uint32_t PWDRAMLDO  : 1;            /*!< (@ 0x00000014) RAM LDO Power Down. 0=powered up, 1=powered down
                                                                    ; This value is propagated only when LDO2SWE
                                                                    bit is active(1).                                          */
      __IOM uint32_t RAMLDOLPMODE : 1;          /*!< (@ 0x00000015) RAM LDO LP Mode. 0=normal mode, 1=low power mode;
                                                                    This value is propagated only when LDO2SWE
                                                                    bit is active(1).                                          */
      __IOM uint32_t CORELDOVDDLEN : 1;         /*!< (@ 0x00000016) Core LDO output enable. 0=Hi-Z, 1=enable. This
                                                                    value is propagated only when LDO2SWE bit
                                                                    is active(1).                                              */
    } LDOREG2_b;
  } ;
  
  union {
    __IOM uint32_t LDOREG3;                     /*!< (@ 0x00000088) LDO Control Register 3                                     */
    
