apache/mynewt-core/hw/mcu/ambiq/apollo2/include/mcu/apollo2.h
    struct {
      __IOM uint32_t MEMLDOLPTRIM : 6;          /*!< (@ 0x00000000) MEM LDO TRIM for low power mode with ADC inactive          */
      __IOM uint32_t MEMLDOLPALTTRIM : 6;       /*!< (@ 0x00000006) MEM LDO TRIM for low power mode with ADC active            */
      __IOM uint32_t TRIMMEMLDOR1 : 6;          /*!< (@ 0x0000000C) MEM LDO active mode trim (R1).                             */
    } LDOREG3_b;
  } ;
  __IM  uint32_t  RESERVED2[29];
  
  union {
    __IOM uint32_t BODPORCTRL;                  /*!< (@ 0x00000100) BOD and PDR control Register                               */
    
    struct {
      __IOM uint32_t PWDPDR     : 1;            /*!< (@ 0x00000000) PDR Power Down.                                            */
      __IOM uint32_t PWDBOD     : 1;            /*!< (@ 0x00000001) BOD Power Down.                                            */
      __IOM uint32_t PDREXTREFSEL : 1;          /*!< (@ 0x00000002) PDR External Reference Select.                             */
      __IOM uint32_t BODEXTREFSEL : 1;          /*!< (@ 0x00000003) BOD External Reference Select.                             */
    } BODPORCTRL_b;
  } ;
  
  union {
    __IOM uint32_t ADCPWRDLY;                   /*!< (@ 0x00000104) ADC Power Up Delay Control                                 */
    
    struct {
      __IOM uint32_t ADCPWR0    : 8;            /*!< (@ 0x00000000) ADC Reference Buffer Power Enable delay in 64
                                                                    ADC CLK increments for ADC_CLKSEL = 0x1,
                                                                    32 ADC CLOCK increments for ADC_CLKSEL
                                                                    = 0x2.                                                     */
      __IOM uint32_t ADCPWR1    : 8;            /*!< (@ 0x00000008) ADC Reference Keeper enable delay in 16 ADC CLK
                                                                    increments for ADC_CLKSEL = 0x1, 8 ADC
                                                                    CLOCK increments for ADC_CLKSEL = 0x2.                     */
    } ADCPWRDLY_b;
  } ;
  __IM  uint32_t  RESERVED3;
  
  union {
    __IOM uint32_t ADCCAL;                      /*!< (@ 0x0000010C) ADC Calibration Control                                    */
    
    struct {
      __IOM uint32_t CALONPWRUP : 1;            /*!< (@ 0x00000000) Run ADC Calibration on initial power up sequence           */
      __IOM uint32_t ADCCALIBRATED : 1;         /*!< (@ 0x00000001) Status for ADC Calibration                                 */
    } ADCCAL_b;
  } ;
  
  union {
    __IOM uint32_t ADCBATTLOAD;                 /*!< (@ 0x00000110) ADC Battery Load Enable                                    */
    
    struct {
      __IOM uint32_t BATTLOAD   : 1;            /*!< (@ 0x00000000) Enable the ADC battery load resistor                       */
    } ADCBATTLOAD_b;
  } ;
  
  union {
    __IOM uint32_t BUCKTRIM;                    /*!< (@ 0x00000114) Trim settings for Core and Mem buck modules                */
    
    struct {
      __IOM uint32_t MEMBUCKR1  : 6;            /*!< (@ 0x00000000) Trim values for BUCK regulator.                            */
      __IM  uint32_t            : 2;
      __IOM uint32_t COREBUCKR1_LO : 6;         /*!< (@ 0x00000008) Core Buck voltage output trim bits[5:0], Concatenate
                                                                    with field COREBUCKR1_HI for the full trim
                                                                    value.                                                     */
      __IM  uint32_t            : 2;
      __IOM uint32_t COREBUCKR1_HI : 4;         /*!< (@ 0x00000010) Core Buck voltage output trim bits[9:6]. Concatenate
                                                                    with field COREBUCKR1_LO for the full trim
                                                                    value.                                                     */
      __IM  uint32_t            : 4;
      __IOM uint32_t RSVD2      : 6;            /*!< (@ 0x00000018) RESERVED.                                                  */
    } BUCKTRIM_b;
  } ;
  
  union {
    __IOM uint32_t ADCTRIM;                     /*!< (@ 0x00000118) ADC Trims                                                  */
    
    struct {
      __IOM uint32_t ADCREFKEEPIBTRIM : 2;      /*!< (@ 0x00000000) ADC Reference Ibias trim                                   */
      __IM  uint32_t            : 4;
      __IOM uint32_t ADCREFBUFTRIM : 5;         /*!< (@ 0x00000006) ADC Reference buffer trim                                  */
      __IOM uint32_t ADCRFBUFIBTRIM : 2;        /*!< (@ 0x0000000B) ADC reference buffer input bias trim                       */
    } ADCTRIM_b;
  } ;
  
  union {
    __IOM uint32_t ADCREFCOMP;                  /*!< (@ 0x0000011C) ADC Reference Keeper and Comparator Control                */
    
    struct {
      __IOM uint32_t ADC_REFCOMP_OUT : 1;       /*!< (@ 0x00000000) Output of the ADC reference comparator                     */
      __IM  uint32_t            : 7;
      __IOM uint32_t ADCREFKEEPTRIM : 5;        /*!< (@ 0x00000008) ADC Reference Keeper Trim                                  */
      __IM  uint32_t            : 3;
      __IOM uint32_t ADCRFCMPEN : 1;            /*!< (@ 0x00000010) ADC Reference comparator power down                        */
    } ADCREFCOMP_b;
  } ;
  __IM  uint32_t  RESERVED4;
  
  union {
    __IOM uint32_t XTALGENCTRL;                 /*!< (@ 0x00000124) XTAL Oscillator General Control                            */
    
    struct {
      __IOM uint32_t ACWARMUP   : 2;            /*!< (@ 0x00000000) Auto-calibration delay control                             */
      __IOM uint32_t XTALBIASTRIM : 6;          /*!< (@ 0x00000002) XTAL IBIAS trim                                            */
      __IOM uint32_t XTALKSBIASTRIM : 6;        /*!< (@ 0x00000008) XTAL IBIAS Kick start trim . This trim value
                                                                    is used during the startup process to enable
                                                                    a faster lock and is applied when the kickstart
                                                                    signal is active.                                          */
    } XTALGENCTRL_b;
  } ;
  __IM  uint32_t  RESERVED5[14];
  
  union {
    __IOM uint32_t EXTCLKSEL;                   /*!< (@ 0x00000160) Source selection of LFRC, HFRC and XTAL clock
                                                                    sources                                                    */
    
