apache/mynewt-core/hw/mcu/ambiq/apollo2/include/mcu/apollo2.h
    struct {
      __IOM uint32_t ENABLE     : 1;            /*!< (@ 0x00000000) Fault Capture Enable field. When set, the Fault
                                                                    Capture monitors are enabled and addresses
                                                                    which generate a hard fault are captured
                                                                    into the FAULTADDR registers.                              */
    } FAULTCAPTUREEN_b;
  } ;
  __IM  uint32_t  RESERVED8[11];
  
  union {
    __IOM uint32_t DBGR1;                       /*!< (@ 0x00000200) Read-only debug register 1                                 */
    
    struct {
      __IOM uint32_t ONETO8     : 32;           /*!< (@ 0x00000000) Read-only register for communication validation            */
    } DBGR1_b;
  } ;
  
  union {
    __IOM uint32_t DBGR2;                       /*!< (@ 0x00000204) Read-only debug register 2                                 */
    
    struct {
      __IOM uint32_t COOLCODE   : 32;           /*!< (@ 0x00000000) Read-only register for communication validation            */
    } DBGR2_b;
  } ;
  __IM  uint32_t  RESERVED9[6];
  
  union {
    __IOM uint32_t PMUENABLE;                   /*!< (@ 0x00000220) Control bit to enable/disable the PMU                      */
    
    struct {
      __IOM uint32_t ENABLE     : 1;            /*!< (@ 0x00000000) PMU Enable Control bit. When set, the MCU's PMU
                                                                    will place the MCU into the lowest power
                                                                    consuming Deep Sleep mode upon execution
                                                                    of a WFI instruction (dependent on the
                                                                    setting of the SLEEPDEEP bit in the ARM
                                                                    SCR register). When cleared, regardless
                                                                    of the requested sleep mode, the PMU will
                                                                    not enter the lowest power Deep Sleep mode,
                                                                    instead entering the Sleep mode.                           */
    } PMUENABLE_b;
  } ;
  __IM  uint32_t  RESERVED10[11];
  
  union {
    __IOM uint32_t TPIUCTRL;                    /*!< (@ 0x00000250) TPIU Control Register. Determines the clock enable
                                                                    and frequency for the M4's TPIU interface.                 */
    
    struct {
      __IOM uint32_t ENABLE     : 1;            /*!< (@ 0x00000000) TPIU Enable field. When set, the ARM M4 TPIU
                                                                    is enabled and data can be streamed out
                                                                    of the MCU's SWO port using the ARM ITM
                                                                    and TPIU modules.                                          */
      __IM  uint32_t            : 7;
      __IOM uint32_t CLKSEL     : 3;            /*!< (@ 0x00000008) This field selects the frequency of the ARM M4
                                                                    TPIU port.                                                 */
    } TPIUCTRL_b;
  } ;
  __IM  uint32_t  RESERVED11[61];
  
  union {
    __IOM uint32_t KEXTCLKSEL;                  /*!< (@ 0x00000348) Key Register to enable the use of external clock
                                                                    selects via the EXTCLKSEL reg                              */
    
    struct {
      __IOM uint32_t KEXTCLKSEL : 32;           /*!< (@ 0x00000000) Key register value.                                        */
    } KEXTCLKSEL_b;
  } ;
} MCUCTRL_Type;                                 /*!< Size = 844 (0x34c)                                                        */



/* =========================================================================================================================== */
/* ================                                            PDM                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief PDM Audio (PDM)
  */

typedef struct {                                /*!< (@ 0x50011000) PDM Structure                                              */
  
  union {
    __IOM uint32_t PCFG;                        /*!< (@ 0x00000000) PDM Configuration Register                                 */
    
    struct {
      __IOM uint32_t PDMCORE    : 1;            /*!< (@ 0x00000000) Data Streaming Control.                                    */
      __IOM uint32_t SOFTMUTE   : 1;            /*!< (@ 0x00000001) Soft mute control.                                         */
      __IOM uint32_t CYCLES     : 3;            /*!< (@ 0x00000002) Number of clocks during gain-setting changes.              */
      __IOM uint32_t HPCUTOFF   : 4;            /*!< (@ 0x00000005) High pass filter coefficients.                             */
      __IOM uint32_t ADCHPD     : 1;            /*!< (@ 0x00000009) High pass filter control.                                  */
      __IOM uint32_t SINCRATE   : 7;            /*!< (@ 0x0000000A) SINC decimation rate.                                      */
      __IOM uint32_t MCLKDIV    : 2;            /*!< (@ 0x00000011) PDM_CLK frequency divisor.                                 */
      __IM  uint32_t            : 4;
      __IOM uint32_t PGALEFT    : 4;            /*!< (@ 0x00000017) Left channel PGA gain.                                     */
      __IOM uint32_t PGARIGHT   : 4;            /*!< (@ 0x0000001B) Right channel PGA gain.                                    */
      __IOM uint32_t LRSWAP     : 1;            /*!< (@ 0x0000001F) Left/right channel swap.                                   */
    } PCFG_b;
  } ;
  
  union {
    __IOM uint32_t VCFG;                        /*!< (@ 0x00000004) Voice Configuration Register                               */
    
