apache/mynewt-core/hw/mcu/ambiq/apollo2/include/mcu/apollo2.h
    struct {
      __IM  uint32_t            : 3;
      __IOM uint32_t CHSET      : 2;            /*!< (@ 0x00000003) Set PCM channels.                                          */
      __IM  uint32_t            : 3;
      __IOM uint32_t PCMPACK    : 1;            /*!< (@ 0x00000008) PCM data packing enable.                                   */
      __IM  uint32_t            : 7;
      __IOM uint32_t SELAP      : 1;            /*!< (@ 0x00000010) Select PDM input clock source.                             */
      __IOM uint32_t DMICKDEL   : 1;            /*!< (@ 0x00000011) PDM clock sampling delay.                                  */
      __IM  uint32_t            : 1;
      __IOM uint32_t BCLKINV    : 1;            /*!< (@ 0x00000013) I2S BCLK input inversion.                                  */
      __IOM uint32_t I2SMODE    : 1;            /*!< (@ 0x00000014) I2S interface enable.                                      */
      __IM  uint32_t            : 5;
      __IOM uint32_t PDMCLK     : 1;            /*!< (@ 0x0000001A) Enable the serial clock.                                   */
      __IOM uint32_t PDMCLKSEL  : 3;            /*!< (@ 0x0000001B) Select the PDM input clock.                                */
      __IOM uint32_t RSTB       : 1;            /*!< (@ 0x0000001E) Reset the IP core.                                         */
      __IOM uint32_t IOCLKEN    : 1;            /*!< (@ 0x0000001F) Enable the IO clock.                                       */
    } VCFG_b;
  } ;
  
  union {
    __IOM uint32_t FR;                          /*!< (@ 0x00000008) Voice Status Register                                      */
    
    struct {
      __IOM uint32_t FIFOCNT    : 9;            /*!< (@ 0x00000000) Valid 32-bit entries currently in the FIFO.                */
    } FR_b;
  } ;
  
  union {
    __IOM uint32_t FRD;                         /*!< (@ 0x0000000C) FIFO Read                                                  */
    
    struct {
      __IOM uint32_t FIFOREAD   : 32;           /*!< (@ 0x00000000) FIFO read data.                                            */
    } FRD_b;
  } ;
  
  union {
    __IOM uint32_t FLUSH;                       /*!< (@ 0x00000010) FIFO Flush                                                 */
    
    struct {
      __IOM uint32_t FIFOFLUSH  : 1;            /*!< (@ 0x00000000) FIFO FLUSH.                                                */
    } FLUSH_b;
  } ;
  
  union {
    __IOM uint32_t FTHR;                        /*!< (@ 0x00000014) FIFO Threshold                                             */
    
    struct {
      __IOM uint32_t FIFOTHR    : 8;            /*!< (@ 0x00000000) FIFO interrupt threshold.                                  */
    } FTHR_b;
  } ;
  __IM  uint32_t  RESERVED[122];
  
  union {
    __IOM uint32_t INTEN;                       /*!< (@ 0x00000200) IO Master Interrupts: Enable                               */
    
    struct {
      __IOM uint32_t THR        : 1;            /*!< (@ 0x00000000) This is the FIFO threshold interrupt.                      */
      __IOM uint32_t OVF        : 1;            /*!< (@ 0x00000001) This is the FIFO overflow interrupt.                       */
      __IOM uint32_t UNDFL      : 1;            /*!< (@ 0x00000002) This is the FIFO underflow interrupt.                      */
    } INTEN_b;
  } ;
  
  union {
    __IOM uint32_t INTSTAT;                     /*!< (@ 0x00000204) IO Master Interrupts: Status                               */
    
    struct {
      __IOM uint32_t THR        : 1;            /*!< (@ 0x00000000) This is the FIFO threshold interrupt.                      */
      __IOM uint32_t OVF        : 1;            /*!< (@ 0x00000001) This is the FIFO overflow interrupt.                       */
      __IOM uint32_t UNDFL      : 1;            /*!< (@ 0x00000002) This is the FIFO underflow interrupt.                      */
    } INTSTAT_b;
  } ;
  
  union {
    __IOM uint32_t INTCLR;                      /*!< (@ 0x00000208) IO Master Interrupts: Clear                                */
    
    struct {
      __IOM uint32_t THR        : 1;            /*!< (@ 0x00000000) This is the FIFO threshold interrupt.                      */
      __IOM uint32_t OVF        : 1;            /*!< (@ 0x00000001) This is the FIFO overflow interrupt.                       */
      __IOM uint32_t UNDFL      : 1;            /*!< (@ 0x00000002) This is the FIFO underflow interrupt.                      */
    } INTCLR_b;
  } ;
  
  union {
    __IOM uint32_t INTSET;                      /*!< (@ 0x0000020C) IO Master Interrupts: Set                                  */
    
    struct {
      __IOM uint32_t THR        : 1;            /*!< (@ 0x00000000) This is the FIFO threshold interrupt.                      */
      __IOM uint32_t OVF        : 1;            /*!< (@ 0x00000001) This is the FIFO overflow interrupt.                       */
      __IOM uint32_t UNDFL      : 1;            /*!< (@ 0x00000002) This is the FIFO underflow interrupt.                      */
    } INTSET_b;
  } ;
} PDM_Type;                                     /*!< Size = 528 (0x210)                                                        */



/* =========================================================================================================================== */
/* ================                                          PWRCTRL                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief PWR Controller Register Bank (PWRCTRL)
  */

typedef struct {                                /*!< (@ 0x40021000) PWRCTRL Structure                                          */
  
  union {
    __IOM uint32_t SUPPLYSRC;                   /*!< (@ 0x00000000) Memory and Core Voltage Supply Source Select
                                                                    Register                                                   */
    
