apache/mynewt-core/hw/mcu/ambiq/apollo2/include/mcu/apollo2.h
    struct {
      __IOM uint32_t MEMBUCKEN  : 1;            /*!< (@ 0x00000000) Enables and select the Memory Buck as the supply
                                                                    for the Flash and SRAM power domain.                       */
      __IOM uint32_t COREBUCKEN : 1;            /*!< (@ 0x00000001) Enables and Selects the Core Buck as the supply
                                                                    for the low-voltage power domain.                          */
      __IOM uint32_t SWITCH_LDO_IN_SLEEP : 1;   /*!< (@ 0x00000002) Switches the CORE DOMAIN from BUCK mode (if enabled)
                                                                    to LDO when CPU is in DEEP SLEEP. If all
                                                                    the devices are off then this does not
                                                                    matter and LDO (low power mode) is used                    */
    } SUPPLYSRC_b;
  } ;
  
  union {
    __IOM uint32_t POWERSTATUS;                 /*!< (@ 0x00000004) Power Status Register for MCU supplies and peripherals     */
    
    struct {
      __IOM uint32_t MEMBUCKON  : 1;            /*!< (@ 0x00000000) Indicate whether the Memory power domain is supplied
                                                                    from the LDO or the Buck.                                  */
      __IOM uint32_t COREBUCKON : 1;            /*!< (@ 0x00000001) Indicates whether the Core low-voltage domain
                                                                    is supplied from the LDO or the Buck.                      */
    } POWERSTATUS_b;
  } ;
  
  union {
    __IOM uint32_t DEVICEEN;                    /*!< (@ 0x00000008) DEVICE ENABLES for SHELBY                                  */
    
    struct {
      __IOM uint32_t IO_SLAVE   : 1;            /*!< (@ 0x00000000) Enable IO SLAVE                                            */
      __IOM uint32_t IO_MASTER0 : 1;            /*!< (@ 0x00000001) Enable IO MASTER 0                                         */
      __IOM uint32_t IO_MASTER1 : 1;            /*!< (@ 0x00000002) Enable IO MASTER 1                                         */
      __IOM uint32_t IO_MASTER2 : 1;            /*!< (@ 0x00000003) Enable IO MASTER 2                                         */
      __IOM uint32_t IO_MASTER3 : 1;            /*!< (@ 0x00000004) Enable IO MASTER 3                                         */
      __IOM uint32_t IO_MASTER4 : 1;            /*!< (@ 0x00000005) Enable IO MASTER 4                                         */
      __IOM uint32_t IO_MASTER5 : 1;            /*!< (@ 0x00000006) Enable IO MASTER 5                                         */
      __IOM uint32_t UART0      : 1;            /*!< (@ 0x00000007) Enable UART 0                                              */
      __IOM uint32_t UART1      : 1;            /*!< (@ 0x00000008) Enable UART 1                                              */
      __IOM uint32_t ADC        : 1;            /*!< (@ 0x00000009) Enable ADC Digital Block                                   */
      __IOM uint32_t PDM        : 1;            /*!< (@ 0x0000000A) Enable PDM Digital Block                                   */
    } DEVICEEN_b;
  } ;
  
  union {
    __IOM uint32_t SRAMPWDINSLEEP;              /*!< (@ 0x0000000C) Powerdown an SRAM Banks in Deep Sleep mode                 */
    
    struct {
      __IOM uint32_t SRAMSLEEPPOWERDOWN : 11;   /*!< (@ 0x00000000) Selects which SRAM banks are powered down in
                                                                    deep sleep mode, causing the contents of
                                                                    the bank to be lost.                                       */
      __IM  uint32_t            : 20;
      __IOM uint32_t CACHE_PWD_SLP : 1;         /*!< (@ 0x0000001F) Enable CACHE BANKS to power down in deep sleep             */
    } SRAMPWDINSLEEP_b;
  } ;
  
  union {
    __IOM uint32_t MEMEN;                       /*!< (@ 0x00000010) Disables individual banks of the MEMORY array              */
    
    struct {
      __IOM uint32_t SRAMEN     : 11;           /*!< (@ 0x00000000) Enables power for selected SRAM banks (else an
                                                                    access to its address space to generate
                                                                    a Hard Fault).                                             */
      __IOM uint32_t FLASH0     : 1;            /*!< (@ 0x0000000B) Enable FLASH 0                                             */
      __IOM uint32_t FLASH1     : 1;            /*!< (@ 0x0000000C) Enable FLASH1                                              */
      __IM  uint32_t            : 16;
      __IOM uint32_t CACHEB0    : 1;            /*!< (@ 0x0000001D) Enable CACHE BANK 0                                        */
      __IM  uint32_t            : 1;
      __IOM uint32_t CACHEB2    : 1;            /*!< (@ 0x0000001F) Enable CACHE BANK 2                                        */
    } MEMEN_b;
  } ;
  
  union {
    __IOM uint32_t PWRONSTATUS;                 /*!< (@ 0x00000014) POWER ON Status                                            */
    
    struct {
      __IM  uint32_t            : 1;
      __IOM uint32_t PDA        : 1;            /*!< (@ 0x00000001) This bit is 1 if power is supplied to power domain
                                                                    A, which supplies IOS and UART0,1.                         */
      __IOM uint32_t PDB        : 1;            /*!< (@ 0x00000002) This bit is 1 if power is supplied to power domain
                                                                    B, which supplies IOM0-2.                                  */
      __IOM uint32_t PDC        : 1;            /*!< (@ 0x00000003) This bit is 1 if power is supplied to power domain
                                                                    C, which supplies IOM3-5.                                  */
      __IOM uint32_t PD_PDM     : 1;            /*!< (@ 0x00000004) This bit is 1 if power is supplied to domain
                                                                    PD_PDM                                                     */
      __IOM uint32_t PD_FLAM0   : 1;            /*!< (@ 0x00000005) This bit is 1 if power is supplied to domain
                                                                    PD_FLAM0                                                   */
      __IOM uint32_t PD_FLAM1   : 1;            /*!< (@ 0x00000006) This bit is 1 if power is supplied to domain
                                                                    PD_FLAM1                                                   */
      __IOM uint32_t PDADC      : 1;            /*!< (@ 0x00000007) This bit is 1 if power is supplied to domain
                                                                    PD_ADC                                                     */
      __IOM uint32_t PD_GRP0_SRAM0 : 1;         /*!< (@ 0x00000008) This bit is 1 if power is supplied to SRAM domain
                                                                    SRAM0_0                                                    */
      __IOM uint32_t PD_GRP0_SRAM1 : 1;         /*!< (@ 0x00000009) This bit is 1 if power is supplied to SRAM domain
                                                                    SRAM0_1                                                    */
      __IOM uint32_t PD_GRP0_SRAM2 : 1;         /*!< (@ 0x0000000A) This bit is 1 if power is supplied to SRAM domain
                                                                    PD_SRAM0_2                                                 */
      __IOM uint32_t PD_GRP0_SRAM3 : 1;         /*!< (@ 0x0000000B) This bit is 1 if power is supplied to SRAM domain
                                                                    PD_SRAM0_3                                                 */
      __IOM uint32_t PD_GRP1_SRAM : 1;          /*!< (@ 0x0000000C) This bit is 1 if power is supplied to SRAM domain
                                                                    PD_GRP1                                                    */
      __IOM uint32_t PD_GRP2_SRAM : 1;          /*!< (@ 0x0000000D) This bit is 1 if power is supplied to SRAM domain
                                                                    PD_GRP2                                                    */
      __IOM uint32_t PD_GRP3_SRAM : 1;          /*!< (@ 0x0000000E) This bit is 1 if power is supplied to SRAM domain
                                                                    PD_GRP3                                                    */
      __IOM uint32_t PD_GRP4_SRAM : 1;          /*!< (@ 0x0000000F) This bit is 1 if power is supplied to SRAM domain
                                                                    PD_GRP4                                                    */
      __IOM uint32_t PD_GRP5_SRAM : 1;          /*!< (@ 0x00000010) This bit is 1 if power is supplied to SRAM domain
                                                                    PD_GRP5                                                    */
      __IOM uint32_t PD_GRP6_SRAM : 1;          /*!< (@ 0x00000011) This bit is 1 if power is supplied to SRAM domain
                                                                    PD_GRP6                                                    */
      __IOM uint32_t PD_GRP7_SRAM : 1;          /*!< (@ 0x00000012) This bit is 1 if power is supplied to SRAM domain
                                                                    PD_GRP7                                                    */
      __IOM uint32_t PD_CACHEB0 : 1;            /*!< (@ 0x00000013) This bit is 1 if power is supplied to CACHE BANK
                                                                    0                                                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t PD_CACHEB2 : 1;            /*!< (@ 0x00000015) This bit is 1 if power is supplied to CACHE BANK
                                                                    2                                                          */
    } PWRONSTATUS_b;
  } ;
  
  union {
    __IOM uint32_t SRAMCTRL;                    /*!< (@ 0x00000018) SRAM Control register                                      */
    
