apache/mynewt-core/hw/mcu/ambiq/apollo2/include/mcu/apollo2.h
    struct {
      __IOM uint32_t SRAM_LIGHT_SLEEP : 1;      /*!< (@ 0x00000000) Enable LS (light sleep) of cache RAMs. When this
                                                                    bit is set, the RAMS will be put into light
                                                                    sleep mode while inactive. NOTE: if the
                                                                    SRAM is actively used, this may have an
                                                                    adverse affect on power since entering/exiting
                                                                    LS mode may consume more power than would
                                                                    be saved.                                                  */
      __IOM uint32_t SRAM_CLKGATE : 1;          /*!< (@ 0x00000001) Enables individual per-RAM clock gating in the
                                                                    SRAM block. This bit should be enabled
                                                                    for lowest power operation.                                */
      __IOM uint32_t SRAM_MASTER_CLKGATE : 1;   /*!< (@ 0x00000002) Enables top-level clock gating in the SRAM block.
                                                                    This bit should be enabled for lowest power
                                                                    operation.                                                 */
    } SRAMCTRL_b;
  } ;
  
  union {
    __IOM uint32_t ADCSTATUS;                   /*!< (@ 0x0000001C) Power Status Register for ADC Block                        */
    
    struct {
      __IOM uint32_t ADC_PWD    : 1;            /*!< (@ 0x00000000) This bit indicates that the ADC is powered down            */
      __IOM uint32_t ADC_BGT_PWD : 1;           /*!< (@ 0x00000001) This bit indicates that the ADC Band Gap is powered
                                                                    down                                                       */
      __IOM uint32_t ADC_VPTAT_PWD : 1;         /*!< (@ 0x00000002) This bit indicates that the ADC temperature sensor
                                                                    input buffer is powered down                               */
      __IOM uint32_t ADC_VBAT_PWD : 1;          /*!< (@ 0x00000003) This bit indicates that the ADC VBAT resistor
                                                                    divider is powered down                                    */
      __IOM uint32_t ADC_REFKEEP_PWD : 1;       /*!< (@ 0x00000004) This bit indicates that the ADC REFKEEP is powered
                                                                    down                                                       */
      __IOM uint32_t ADC_REFBUF_PWD : 1;        /*!< (@ 0x00000005) This bit indicates that the ADC REFBUF is powered
                                                                    down                                                       */
    } ADCSTATUS_b;
  } ;
  
  union {
    __IOM uint32_t MISCOPT;                     /*!< (@ 0x00000020) Power Optimization Control Bits                            */
    
    struct {
      __IOM uint32_t ADC_EN_MASK : 1;           /*!< (@ 0x00000000) Control Bit to mask the ADC_EN in the adc_pwr_down
                                                                    equation.                                                  */
      __IOM uint32_t DIS_LDOLPMODE_HFRC : 1;    /*!< (@ 0x00000001) Setting this bit will enable the Core LDO to
                                                                    be in LPMODE during deep sleep even when
                                                                    HFRC is enabled.                                           */
      __IOM uint32_t DIS_LDOLPMODE_TIMERS : 1;  /*!< (@ 0x00000002) Setting this bit will enable the MEM LDO to be
                                                                    in LPMODE during deep sleep even when the
                                                                    ctimers or stimers are running                             */
    } MISCOPT_b;
  } ;
} PWRCTRL_Type;                                 /*!< Size = 36 (0x24)                                                          */



/* =========================================================================================================================== */
/* ================                                          RSTGEN                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief MCU Reset Generator (RSTGEN)
  */

typedef struct {                                /*!< (@ 0x40000000) RSTGEN Structure                                           */
  
  union {
    __IOM uint32_t CFG;                         /*!< (@ 0x00000000) Configuration Register                                     */
    
    struct {
      __IOM uint32_t BODHREN    : 1;            /*!< (@ 0x00000000) Brown out high (2.1v) reset enable.                        */
      __IOM uint32_t WDREN      : 1;            /*!< (@ 0x00000001) Watchdog Timer Reset Enable. NOTE: The WDT module
                                                                    must also be configured for WDT reset.                     */
    } CFG_b;
  } ;
  
  union {
    __IOM uint32_t SWPOI;                       /*!< (@ 0x00000004) Software POI Reset                                         */
    
    struct {
      __IOM uint32_t SWPOIKEY   : 8;            /*!< (@ 0x00000000) 0x1B generates a software POI reset.                       */
    } SWPOI_b;
  } ;
  
  union {
    __IOM uint32_t SWPOR;                       /*!< (@ 0x00000008) Software POR Reset                                         */
    
